[
    {
        "product_id": "B07SM135LS",
        "title": "Digi-Tatoo Decal Skin Compatible With MacBook Pro 13 inch (Model A2338/ A2289/ A2251) - Protective and Decorative Full Body Laptop Skin Decal Sticker, Anti-Scratch Vinly Skin Sticker Wrap [Fresh Marble]",
        "brand": "Digi-Tatoo",
        "category": "Electronics",
        "price": 19.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 246,
        "image_url": "https://m.media-amazon.com/images/I/31t4bj9t88L._AC_.jpg"
    },
    {
        "product_id": "B089CNGZCW",
        "title": "NotoCity Compatible with Vivoactive 4 band 22mm Quick Release Silicone Bands/Garmin Darth Vader/First Avenger/Polar Vantage Smartwatch Sport Breathable Strap Replacement for Gear S3 Classic Watchband",
        "brand": "NotoCity",
        "category": "Electronics",
        "price": 9.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 233,
        "image_url": "https://m.media-amazon.com/images/I/41j56fjX6SL._AC_.jpg"
    },
    {
        "product_id": "B004E2Z88O",
        "title": "Motorola Droid X Essentials Combo Pack",
        "brand": "Verizon",
        "category": "Electronics",
        "price": 14.99,
        "description": "all Genuine High Quality Motorola Made Accessories, including Multimedia Station with HDMI technology, HDMI Cable and AC Wall Charger, Motorola Navigation / Music Vehicle Charging Mount Car Dock and Motorola 12v Vehicle Power Adapter Charger!",
        "average_rating": 3.8,
        "total_reviews": 64,
        "image_url": "https://m.media-amazon.com/images/I/51-DXSMlHaL._AC_.jpg"
    },
    {
        "product_id": "B07BJ7ZZL7",
        "title": "QGHXO Band for Garmin Vivofit 4, Soft Silicone Replacement Watch Band Strap for Garmin Vivofit 4 Activity Tracker, Small, Large, Ten Colors (5PCS Bands-Girl, Large)",
        "brand": "QGHXO",
        "category": "Electronics",
        "price": 14.89,
        "description": "Compatibility Custom designed for your precious Garmin Vivofit 4 Activity Tracker, this Garmin Watch Sport Band features a combination of functionality and style. Fit for Garmin Vivofit 4 Activity Tracker ONLY. NOT for Garmin Vivofit 1/Garmin Vivofit 2/Garmin Vivofit 3. Feature Material: Silicone. NOTE: Replacement Bands Only! Small fits wrists with a circumference of 122-188mm.  Large fits wrists with a circumference of 148-215mm. Models for selection: For Garmin Vivofit 4 Activity Tracker Only. Contracted design style, with you life contracted and not simple. Package Included Soft Silicone Replacement Watch Band Strap for Garmin Vivofit 4 Activity Tracker (No Tracker)",
        "average_rating": 4.4,
        "total_reviews": 707,
        "image_url": "https://m.media-amazon.com/images/I/51UefzXMzvL._AC_.jpg"
    },
    {
        "product_id": "B00R6R82HS",
        "title": "Fishfinder, Depth Finder Poly Sun Cover for 3\" - 4\" Models - Protects Your Screen from Sun / Weather Damage",
        "brand": "Westlake Market",
        "category": "Electronics",
        "price": 10.99,
        "description": "Affordable and convenient way to cover your sonar unit. Protects from the sun and repells rain/snow. (It is water resistant, not waterproof). Has drawstring on bottom for securing tightly. Oversize design to fit over cables.",
        "average_rating": 4.4,
        "total_reviews": 86,
        "image_url": "https://m.media-amazon.com/images/I/51VAoCIS-dL._AC_.jpg"
    },
    {
        "product_id": "B07Y6K1PRB",
        "title": "Novelty Cute Cartoon USB 2.0 Flash Drive Data Storage Memory Stick Cartoon USB Stick Pendrive Gift (16GB, Camera Black)",
        "brand": "Fire Stone",
        "category": "Electronics",
        "price": 8.98,
        "description": "This is a special usb stick that make as a cute camera shape.It is fun that use it to store photos and videos you tade;Or as a surprising gift for photographers. The perfect small size USB memory stick comes with a beaded key chain,you can hang it on something to decorate the thing you want,such as keychain/bag. Made out of soft rubber,shockproof, drop-proof Allow to store all of homework,course files,photos,favorite music and film. No need drive,only plug in. Easy to read and read in high speed.  Package Included: 1x U Disk 1x Chain",
        "average_rating": 4.7,
        "total_reviews": 198,
        "image_url": "https://m.media-amazon.com/images/I/41Rnlz2ezPL._AC_.jpg"
    },
    {
        "product_id": "B07848ZT9T",
        "title": "ANNKE 4K 16CH Security DVR Recorder with Human & Vehicle Detection and (16) 8MP Outdoor Bullet Cameras with IP67 Weatherproof, 100ft Night Vision with EXIR, Email Alert, NO Hard Drive",
        "brand": "ANNKE",
        "category": "Electronics",
        "price": 909.99,
        "description": "ANNKE 16 channel 4K DVR security camera system can deliver true 4K Ultra HD footages day or night. IP67 waterproof housing makes the outdoor bullet surveillance cameras withstand extreme weather, perfect for outdoor & indoor protection without limitation, including home, company, office, factory, warehouse, yard, ville, garage, etc. Key Features: 4K Ultra HD Clarity 100 ft EXIR Night Vision H.265+ Video Format Expandable 5-in-1 16CH DVR 5 Smart Detection Ways Multi-Level Encryptions Area Mask for Privacy Protection Outdoor IP67 Weatherproof Digital WDR & 2D DNR 4K HDMI & 1080p VGA Output DVR Spec: Video Compression：H.264+/H.264/H.265/H.265+ Video Input: 16CH Analog HD/Analog + 16CH IP IPC Recording/Playback Resolution: Up to 8MP IP Camera Input: 16CH HDD：2 SATA Interface HDD Capacity：Up to 10 TB Capacity Network Interface: RJ45 X1 (10/100 M) USB: USB 2.0 X1, USB 3.0 X1 Camera Spec: Image Sensor: 8MP CMOS Image Sensor Video Resolution: 3840(H) × 2160(V) Lens: 2.8 mm Night Vision Distance: Up to 100ft/30m Weatherproof Rating：IP67 What’s Included? * 1× 16CH 4K DVR, NO Hard Drive * 16X 8MP Security Cameras * 1× Power Adapter for DVR * 4× Power Adapter for Cameras * 16× 60ft/18.3m BNC Cables * 4× 4-to-1 Power Splitter * 1× USB Mouse * 1× User Manual * 16× Mounting Screw Bags",
        "average_rating": 5.0,
        "total_reviews": 2,
        "image_url": "https://m.media-amazon.com/images/I/41FZDJrOWwL._AC_.jpg"
    },
    {
        "product_id": "B00VBTJCJE",
        "title": "BIPRA U3 2.5 inch USB 3.0 NTFS Portable External Hard Drive - White (250GB)",
        "brand": "BIPRA",
        "category": "Electronics",
        "price": 98.49,
        "description": "Bipra external USB 2.5\" portable size hard drive comes with free carry case. You can store all data in your Pocket size drive. Ultra slim design. Formatted and ready to be used. No messing about needed, just plug it into your USB Ports and away you go. Support plug and play. Ideal for data backup, photos, video, iTunes, iPod,MP3, MP4 and presentations etc. Support USB3.0 with up to 5 GB/Sec ultrahigh transfer speed, backward compatibility usb2.0, copy huge files in a minutes time. Can be utilised on any personal computers, desktop or laptop. Formatted in NTFS for you to use on Windows OS. Available in white colour.",
        "average_rating": 5.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/21Ic71VXQ3L._AC_.jpg"
    },
    {
        "product_id": "B0BPLX8B2K",
        "title": "Outer Space Planets Stickers(50Pcs),Planetary Systems Waterproof Vinyl Water Bottle Stickers for Teens Girls Adults Kids,Laptop Car Cup Computer Guitar Skateboard Luggage Phone Aesthetic Stickers Pack",
        "brand": "Affoto",
        "category": "Electronics",
        "price": 3.99,
        "description": "Features: - Clear picture and exquisite printing. - Can easily peel off and stick on other place. - Sun protection and Waterproof! Never faded out! - Just for smooth surface. Do not suitable for rough surface. How to use: 1.Think about where you want to paste 2.Clean the surface of the object 3.Tear off the bottom paper 4.Firmly stick the sticker on the surface of the object Specification Quantity:50 pieces Size : 2-3.5 inch Material : Waterproof vinyl PVC",
        "average_rating": 4.5,
        "total_reviews": 50,
        "image_url": "https://m.media-amazon.com/images/I/51DMyPUVryL._AC_.jpg"
    },
    {
        "product_id": "B0BYBG1PPD",
        "title": "Gateway 15.6\" FHD Ultra Slim Budget Notebook, Intel Pentium Processor(4-Core, up to 3.1 GHz), 4GB RAM, 128GB Storage, Precision Touchpad, HDMI, Type-C Windows 10S, Microsoft 365 1 Year, Charcoal Black",
        "brand": "Gateway",
        "category": "Electronics",
        "price": 189.99,
        "description": "Processor: Intel® Pentium® Silver N5030 Processor (1.10GHz, Up to 3.10GHz, 4M Cache) Display: 15.6” LCD IPS Display, (1920 x 1080) Operating system: Windows 10 Home 64-bit English in S mode Video Card: Intel UHD Graphics 605 Memory: 4 GB DDR4 RAM Hard drive Size: 128GB eMMC Wireless: Wi-Fi5 (802.11ac) for speeds up to 3x faster than 802.11n Ports: HDMI Output x 1, USB Type-C x 1, USB 3.0 x 2 Battery: Up to 8.5 hours of battery life Dimensions: 14.8” x 9.6” x 0.8” Inches Weight: 4.2lbs Color: Black ENERGY STAR Certified: Yes How to switch s mode to windows 10 1. On your PC running Windows 10 in S mode, open Settings > Update & Security > Activation. 2. In the Switch to Windows 10 Home or Switch to Windows 10 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.) 3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.",
        "average_rating": 4.1,
        "total_reviews": 15,
        "image_url": "https://m.media-amazon.com/images/I/41uiwpD6FmL._AC_.jpg"
    },
    {
        "product_id": "B0C2VCWPGY",
        "title": "VILTROX 24mm F1.8 f/1.8 FE Full-Frame Wide-Angle Prime Autofocus Lens for Sony E-Mount Camera a7R4 A7III A7S2 A5100 A6600 A6500 A6400 A6300 A6000 A7RIV A7RIII A7SIII A7III A7RII A7II A7S A7R A7",
        "brand": "VILTROX",
        "category": "Electronics",
        "price": 379.0,
        "description": "",
        "average_rating": 3.9,
        "total_reviews": 16,
        "image_url": "https://m.media-amazon.com/images/I/51fj-+9ZO8L._AC_.jpg"
    },
    {
        "product_id": "B093N94GPG",
        "title": "Polaroid Originals Now Viewfinder i-Type Instant Camera (White) Bundle with Color and B and W Instant Film and Reusable Vintage Photo Accessory (4 Items)",
        "brand": "Polaroid Originals",
        "category": "Electronics",
        "price": 179.99,
        "description": "Polaroid Originals Now Viewfinder i-Type Instant Camera Polaroid’s new point-and-shoot analog instant camera has all you need to catch every life moment in an original Polaroid photograph. Now with autofocus, it’s simple to capture moments as you see them, so you can relive them forever in sharp, vivid color. Frame two moments in one with double exposure, or get yourself in the picture with self-timer and an accurate flash to make everyone look like they should. Simplicity Meets Functionality The Now takes simplicity and adds greater creative control, clean design, and vibrant color to make it more than a moment maker — but a life accessory. Thanks to the Autofocus 2 lens system, the Polaroid Now decides which lens is suitable, so you get beautiful portraits in more places, more often — even without the flash. This dreamy, artistic instant camera is ready to add some drama to your photography by providing two frames in one Polaroid photograph with the built-in double exposure. Additionally, the self-timer gives you 9 seconds to get in the picture with your friends and be a part of the memory you are capturing. Bundle Includes: Polaroid Originals Now Viewfinder i-Type Instant Camera (White) Polaroid Originals Now Viewfinder i-Type Instant Camera (White) Polaroid Originals Color Instant Film for i-Type Cameras (8 Exposures) Polaroid Originals Color Instant Film for i-Type Cameras (8 Exposures) Film Kit for Polaroid i-Type, 600 and SX-70 with Magnetic/Hanging Frames, Storage Box Film Kit for Polaroid i-Type, 600 and SX-70 with Magnetic/Hanging Frames, Storage Box Polaroid B and W Film for i-Type Cameras Polaroid B and W Film for i-Type Cameras",
        "average_rating": 4.8,
        "total_reviews": 48,
        "image_url": "https://m.media-amazon.com/images/I/41EruEz9MtL._AC_.jpg"
    },
    {
        "product_id": "B07QF5117Q",
        "title": "NVIDIA NVS 310 by PNY 1 GB DDR3 PCI Express Gen 2 x16 DisplayPort 1.2 Multi-Display Professional Graphics Board, VCNVS310DP-PB (Renewed)",
        "brand": "Amazon Renewed",
        "category": "Electronics",
        "price": 34.98,
        "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
        "average_rating": 4.2,
        "total_reviews": 17,
        "image_url": "https://m.media-amazon.com/images/I/41jwDgHFwRL._AC_.jpg"
    },
    {
        "product_id": "B094C5ZN1M",
        "title": "luo Cherry MX RGB Switch Mute Pink Switch Mute Gray Switch Genuine German Cherry Switch (10PCS, Cherry RGB Mute Gray Switch)",
        "brand": "LUO",
        "category": "Electronics",
        "price": 13.99,
        "description": "Cherry powder: a quiet version of cherry red, commonly referred to as cherry powder Cherry gray: a quieter version of cherry black, usually called cherry gray",
        "average_rating": 4.0,
        "total_reviews": 12,
        "image_url": "https://m.media-amazon.com/images/I/211Y0dSEIGL._AC_.jpg"
    },
    {
        "product_id": "B01MG5L0H0",
        "title": "AntennaMastsRus - Made in USA - 4 Inch Black Aluminum Antenna is Compatible with Audi Allroad (2001-2005)",
        "brand": "AntennaMastsRus",
        "category": "Electronics",
        "price": 22.99,
        "description": "This is a \"BRAND NEW\" Custom SHORT 4\" Black Aluminum Antenna Mast. Sick of a Broken/Bent antenna or the obnoxiously tall un-stylish antenna your vehicle comes with?? Then this is the custom solution for you! This antenna is Manufactured and Anodized right here in Wisconsin!! Our experience with fit and finish is: If you want it done right, you must do it yourself! No one beats U.S.A Quality, PERIOD! This antenna is made of 6061 grade aluminum construction and finished with a durable Anodized Coating. The anodized coating cannot peel or flake off. It is part of the metal and gives the aluminum a deeper, richer metallic appearance. There will be a reduction in antenna performance due to the antenna size being shortened from the Factory antenna. Any questions or concerns on any of our products feel free to contact us by telephone or email by clicking on TheAntennaSource about us page here on Amazon. ** This antennas main design is for appearance enhancements. Its AM/FM radio reception performance works best for local stations (Satellite Radio/Navigation/Bluetooth not effected). For the BEST reception short antenna check out our SHORT 6 3/4\" antenna found in our store.",
        "average_rating": 4.3,
        "total_reviews": 7,
        "image_url": "https://m.media-amazon.com/images/I/21bRd1xv6QL._AC_.jpg"
    },
    {
        "product_id": "B0178F72E6",
        "title": "HP Elitebook 8560W New Replacement LCD Screen for Laptop LED HD Matte",
        "brand": "HP",
        "category": "Electronics",
        "price": 63.33,
        "description": "This is a compatible replacement screen for the model listed in the title.",
        "average_rating": 4.7,
        "total_reviews": 4,
        "image_url": "https://m.media-amazon.com/images/I/41gvw+myv+L._AC_.jpg"
    },
    {
        "product_id": "B0822SL7JX",
        "title": "May Chen Compatible with MacBook Pro 16 inch Case 2020 2019 Release A2141 with Touch Bar&Touch ID, Plastic Hard Shell Case with Keyboard Cover + Screen Protector, Abstract Leaves",
        "brand": "May Chen",
        "category": "Electronics",
        "price": 26.99,
        "description": "May Chen High Quality Plastic Hard Shell Case & Keyboard cover and Screen protector and Dust plug Designed ONLY to be compatible with 2019 Release For Macbook Pro 16 inch Model:A2141. Please kindly check the model number \"\"A1xxx\"\"on the bottom of the notebook before you purchase, make sure you choose the exact same model number as the listing title stated \"A2141\". Features - Protects your Mac book from accidental hard knocks and scratches Fully access to all buttons and features - Plug your charger, cable or headset without removing the case - Simple clip-on/off design without the added risk of harming your laptop during application",
        "average_rating": 4.5,
        "total_reviews": 649,
        "image_url": "https://m.media-amazon.com/images/I/51mR3hFRLsL._AC_.jpg"
    },
    {
        "product_id": "B09M7TH3YC",
        "title": "Wenlaty Case Compatible with iPad 9th /8th /7th Generation Case(2021/2020/2019), Full Body Protective with Pencil Holder, Designed for iPad 10.2 Inch, Auto Sleep/Wake Cover, Sky Blue",
        "brand": "Wenlaty",
        "category": "Electronics",
        "price": 19.99,
        "description": "",
        "average_rating": 4.7,
        "total_reviews": 1915,
        "image_url": "https://m.media-amazon.com/images/I/41o1pNK2igL._AC_.jpg"
    },
    {
        "product_id": "B07VJXK7BV",
        "title": "Ares Vision Universal mounting CCTV Security Camera Wall Junction Box Bracket with Hidden Compartment (1 Pack, Wall Dome)",
        "brand": "ARES VISION",
        "category": "Electronics",
        "price": 13.99,
        "description": "",
        "average_rating": 3.9,
        "total_reviews": 96,
        "image_url": "https://m.media-amazon.com/images/I/314+6fI-J5L._AC_.jpg"
    },
    {
        "product_id": "B00FSTW88K",
        "title": "Centon Electronics Flash Memory Card (S1-SDHU1-32G)",
        "brand": "Centon",
        "category": "Electronics",
        "price": 8.99,
        "description": "Product Description Centon 32GB SDHC UHS-1. Using the latest in memory technologies and design, Centon brings quality, reliable storage products for you to enjoy and depend on. Manufacturer Contact Information support@otmessentials.com",
        "average_rating": 4.8,
        "total_reviews": 4,
        "image_url": "https://m.media-amazon.com/images/I/41mNMKMcXjL._AC_.jpg"
    },
    {
        "product_id": "B08862M8VY",
        "title": "Galaxy Tab A 10.1 Case 2019 - Techcircle Slim PU Leather Multiple Angle Stand Case with Card Slots Shockproof Cover for Samsung Galaxy Tab A 10.1 Inch Tablet SM-T510/T515 2019 Release, Purple Owl",
        "brand": "Techcircle",
        "category": "Electronics",
        "price": 17.99,
        "description": "❣❣ Techcircle Slim Lightweight Flip Stand Case for Samsung Galaxy Tab A 10.1 Inch 2019 Release Tablet (Model: SM-T510/T515) ❣❣ ❥ Kickstand Feature: - Adjust different viewing angles as per your needs.  - Anti-slip stripes, effectively increase the stability of the stand.  - Free your hands and bring you the most comfortable viewing angle. ❥ Slim Profile: - Slim and lightweight - Minimal bulk, minimalism style, great for carry around. ❥ Stylus Holder: - Built-in stylus pen holder, also comes with a free stylus pen. Various colors available. ❥ Precise Cutouts: - Full access to all controls and features (charging, camera ports) without removing the case. ❥ High-quality Material: - Premium composition leather exterior and soft interior offer great protection against daily use. ❥ Card Holders: - Card slot is convenient for storing credit cards, business cards or cash, withouy taking your bulky wallet. ❥ What Will You Get? - 1x Samsung Galaxy Tab A 10.1 2019 Case  - 1x Random Color Stylus Pen  - 1x Cleaning Cloth Your satisfaction are very important for us. If there's any further question, pls feel free to contact us. Our team will provide best service to you. =^_^=",
        "average_rating": 4.0,
        "total_reviews": 17,
        "image_url": "https://m.media-amazon.com/images/I/51TnFCnglcL._AC_.jpg"
    },
    {
        "product_id": "B0BSQL7M51",
        "title": "PNY 1TB PRO Elite Class 10 U3 V30 microSDXC Flash Memory Card - 100MB/s, Class 10, U3, V30, A2, 4K UHD, Full HD, UHS-I, micro SD",
        "brand": "PNY",
        "category": "Electronics",
        "price": 109.99,
        "description": "PNY PRO Elite Class 10 U3 V30 microSD Cards offer peak performance for smartphones, tablets, drones, action cameras, surveillance cameras, gaming consoles, and more. With a read speed of up to 100MB/s and write speed of up to 90MB/s, users can quickly capture and share high resolution content. U3 technology is perfect for 4K Ultra HD videography and HD photography, making these cards the perfect solution by which to capture stunning 4K video, HD photos, music, apps, and more. What’s more, the PRO Elite microSD Flash Memory Cards feature V30 Video Speed Class, ideal for 4K Ultra HD video at 4096x3072 format, allowing users to capture high quality content on today's 4K Ultra-HD devices. Additionally, these cards are rated A2 which optimizes the PRO Elite microSD for app performance; allowing users to run apps directly from the microSD card, delivering faster app launch and performance than ever before. With PNY's PRO Elite Class 10 U3 V30 microSD cards, users can experience memories that feel as real as the day they captured them.",
        "average_rating": 4.7,
        "total_reviews": 3380,
        "image_url": "https://m.media-amazon.com/images/I/41w5om5v1tL._AC_.jpg"
    },
    {
        "product_id": "B0BKS1K986",
        "title": "LENTION USB C Docking Station, 10 Gbps USB C&USB A Ports, 4K 60Hz HDMI, 100W PD, Ethernet, Card Reader, USB 3.0, AUX, USB C Dock for MacBook/Surface, More, Stable Driver USB C Hub(CB-D65, Space Gray)",
        "brand": "LENTION",
        "category": "Electronics",
        "price": 89.99,
        "description": "",
        "average_rating": 4.4,
        "total_reviews": 16,
        "image_url": "https://m.media-amazon.com/images/I/31Z1VcSvljL._AC_.jpg"
    },
    {
        "product_id": "B08K2T4JFQ",
        "title": "JBL FLIP 5 - Waterproof Portable Bluetooth Speaker Made from 100% Recycled Plastic - Blue (Renewed)",
        "brand": "Amazon Renewed",
        "category": "Electronics",
        "price": 79.9,
        "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
        "average_rating": 4.7,
        "total_reviews": 762,
        "image_url": "https://m.media-amazon.com/images/I/412T8FTJynL._AC_.jpg"
    },
    {
        "product_id": "B07C4YHF4L",
        "title": "AvimaBasics Ear Buds, Spare Kit Earloops Buds Compatible with Plantronics WH500 CS540 W440 Savi W740 - Includes: 3 Earloop, 3 Eartips Guarantee! (1 Pack)",
        "brand": "AVIMABASICS",
        "category": "Electronics",
        "price": 9.99,
        "description": "Replacement Compatible with Plantronics WH500 CS540 W440 Savi W740 Earloops Kit Plantronics CS540 Earloops Kit The Plantronics 86540-01 Eartip with earloop is for use with WH500 CS540 W440 Savi W740 headsets. 86540-01 Features: Eartip w/ Earloop Kit For WH500 CS540 W440 Savi W740 headsets Smokey Color Ear Loop Made Of Nylon Material Includes: 1 small, 1 Medium, 1 Large Earloop & 1 small, 1 medium and 1 large Ear Tips NOTE: Foam Tube is NOT included!",
        "average_rating": 4.2,
        "total_reviews": 160,
        "image_url": "https://m.media-amazon.com/images/I/41-SjKn1j1L._AC_.jpg"
    },
    {
        "product_id": "B01AC7EOL6",
        "title": "Compatible with Ford Explorer 2006 2007 2008 2009 2010 Double DIN Stereo Harness Radio Install Dash Kit Package",
        "brand": "Harmony Audio",
        "category": "Electronics",
        "price": 27.99,
        "description": "This Package Includes the Following Items: 1 x Metra 95-5812 Double DIN Installation Kit for Select 2004-2006 Ford Vehicles 1 x Metra 95-5812 Double DIN Installation Kit for Select 2004-2006 Ford Vehicles 1 x Harmony Audio HA-705520 Ford Lincoln Mercury Factory Stereo to Aftermarket Radio Harness Adapter 1 x Harmony Audio HA-705520 Ford Lincoln Mercury Factory Stereo to Aftermarket Radio Harness Adapter 1 x Chrysler Chevy Dodge For Lincoln Jeep Factory Radio to Aftermarket Antenna Adapter 1 x Chrysler Chevy Dodge For Lincoln Jeep Factory Radio to Aftermarket Antenna Adapter Metra 95-5812 Double DIN Installation Kit for Select 2004-2006 Ford Vehicles: Install dash kit for Double DIN/ISO Radios Install dash kit for Double DIN/ISO Radios Designed and manufactured with precision tolerances, resulting in a gapless fit between the dash and the kit Designed and manufactured with precision tolerances, resulting in a gapless fit between the dash and the kit Painted to match factory dash color Painted to match factory dash color High-grade ABS plastic construction High-grade ABS plastic construction Factory style texture Factory style texture Product Guide: Product Guide: Kit Includes:Radio Housing Trim PlateRadio Housing Brackets Kit Includes: Radio Housing Trim Plate Radio Housing Trim Plate Radio Housing Brackets Radio Housing Brackets Harmony Audio HA-705520 Ford Lincoln Mercury Factory Stereo to Aftermarket Radio Harness Adapter: Specifications: Simply plug and play installation, no cutting required Simply plug and play installation, no cutting required Designed for standard audio system, premium audio may require different harness Designed for standard audio system, premium audio may require different harness Clearly marked color coded wires Clearly marked color coded wires Ideal for aftermarket radio Ideal for aftermarket radio 18 gauge high quality wire 18 gauge high quality wire Direct OEM fit connection Direct OEM fit connection Chrysler Chevy Dodge For Lincoln Jeep Factory Radio to Aftermarket Antenna Adapter: Specifications Simply plug and play installation, no cutting required Simply plug and play installation, no cutting required Adapts factory antenna plug into aftermarket style Adapts factory antenna plug into aftermarket style Ideal for aftermarket radio Ideal for aftermarket radio Direct OEM fit connection Direct OEM fit connection",
        "average_rating": 3.9,
        "total_reviews": 11,
        "image_url": "https://m.media-amazon.com/images/I/41snZ36HJBL._AC_.jpg"
    },
    {
        "product_id": "B07MVKYVVL",
        "title": "10-Pack Replacement Clamp Bluetooth Ear Hook Loop Clip Replacement - Set Of 5 Black SMALL Clamps + 5 Pack Black Large Clamps Shape Clear Hook for Samsung, Motorola, LG & Other Bluetooth Headsets",
        "brand": "Tricon",
        "category": "Electronics",
        "price": 3.49,
        "description": "Description Replace your old ear hooks and ear tips, get your old Headset to look and feel like new!  The 10 Piece Set is super quality and ever lasting design ideal for most Plantronics Bluetooth models, also fits on lots of other Bluetooth. Very easy to adjust and clamp on your Bluetooth device. Universal replacement type - Small Clamp Clear Compatible with Motorola H 12 15 270 371 375 385 390 560 620 680 681 685 690 695 780 790 N136 HK 100 200 201 202 Samsung Wep 490 650 750 850 870 HM 1000 1100 3500 Modus HM3500 LG HBM 210 230 235 310 330 520 530 550 560 570 585 730 750 760 770 800 Plantronics 925 975 M100 MX100 Jawbone Icon and many others. Package Content: 5 x Black Earhook Small Clamp (Radius Clip Around 4mm)5 x Black Earhook Large Clamp (Radius Clip Around 6mm) Please Feel Free to Contact Us!",
        "average_rating": 3.6,
        "total_reviews": 798,
        "image_url": "https://m.media-amazon.com/images/I/41Q4BZCw3eL._AC_.jpg"
    },
    {
        "product_id": "B0821M984B",
        "title": "Cable Raceways - Floor Cord Protector Cable Shield Cord Cover PVC Floor Wire Protect",
        "brand": "Tenkful",
        "category": "Electronics",
        "price": 17.87,
        "description": "Cable Raceways - Floor Cord Protector Cable Shield Cord Cover PVC Floor Wire Protect",
        "average_rating": 4.3,
        "total_reviews": 721,
        "image_url": "https://m.media-amazon.com/images/I/51QcMO5k6PL._AC_.jpg"
    },
    {
        "product_id": "B0BGPG7ZNM",
        "title": "MHYALUDO Silicone Print Case Cover for Apple Airpods Pro 2nd Generation 2022 & 1st Generation 2019 Charging Case, Soft Earpods Case with keychain for Women with Airpods Pro Charging Case-White Leopard",
        "brand": "MHYALUDO",
        "category": "Electronics",
        "price": 10.99,
        "description": "",
        "average_rating": 5.0,
        "total_reviews": 12,
        "image_url": "https://m.media-amazon.com/images/I/515zAX7ynqS._AC_.jpg"
    },
    {
        "product_id": "B08GFTPQ5B",
        "title": "iCasso Compatible with MacBook Pro 13 Inch Case 2016-2020 Release A2338 M1 A2251 A2289 A2159 A1989 A1706 A1708, Hard Plastic Case, Sleeve, Screen Protector, Keyboard Cover & Dust Plug - Serenity Blue",
        "brand": "iCasso",
        "category": "Electronics",
        "price": 27.99,
        "description": "",
        "average_rating": 4.4,
        "total_reviews": 3503,
        "image_url": "https://m.media-amazon.com/images/I/41vx1ANmnuL._AC_.jpg"
    },
    {
        "product_id": "B086W46TYP",
        "title": "SUPCASE UB Pro Series Case for iPad Pro 12.9 inch for 2020 Release only, Support Apple Pencil Charging with Built-in Screen Protector Full-Body Rugged Kickstand Protective Case (Black)",
        "brand": "SUPCASE",
        "category": "Electronics",
        "price": 27.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 4050,
        "image_url": "https://m.media-amazon.com/images/I/415oLjAIJNL._AC_.jpg"
    },
    {
        "product_id": "B0B1BXC6W1",
        "title": "Nurse Stickers for Water Bottles and Laptop, Nursing Stickers for Nurse Students, Nurses, and Healthcare Workers, Waterproof, Reusable, No Residue Vinyl Decal Perfect Nurse Gift (108 Designs)",
        "brand": "ABAMERICA",
        "category": "Electronics",
        "price": 8.99,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 123,
        "image_url": "https://m.media-amazon.com/images/I/61qHLKTAKSL._AC_.jpg"
    },
    {
        "product_id": "B07DYJR44S",
        "title": "13-15.6 Inch Laptop Sleeve Case Women Men Shoulder Bag Briefcase Messenger Bag Portable Handbag",
        "brand": "dealcase",
        "category": "Electronics",
        "price": 14.88,
        "description": "15-15.6 Inch Laptop Computer Case Cover Sleeve Shoulder Strap Bag Internal Dimensions: 15.94 x 11.81 x 1.2 inch (40.5 mm x 300 mm x 30 mm). Compatible With: Acer: Acer Aspire E 15 E5-575 , E5-575G / Acer Aspire E 15,Aspire 5 / Acer Predator Helios 300 / Acer Nitro 5 / Acer Flagship CB3-532 / Acer Chromebook 15 CB5-571 , C910 , CB3-531,Acer Swift 3 Laptop 15.6 \" , 2018 Newest Acer 15.6” ,Acer Aspire VX 15 Gaming Laptop,Acer 15.6\" Chromebook and etc. ASUS: ASUS ZenBook Pro UX501VW 15.6\" / ASUS K501UX 15.6 inch / ASUS VivoBook F510UA / ASUS X550ZA / F555LA / X555LA / F555UA / X550ZA / X555YA / K501LX / X540LA / X555YA / Q504UA / Q503 / ASUS X550 / X55C-DS31 / X551 / X553 / F551 / F553 / K501 / K501UW / GL552VW / X551MA and etc. HP: HP 15-F222WM 15.6\" , 15-F211WM / HP Pavilion 15.6\" / HP Premium 15.6\" / HP Flagship 15.6\" / 15-BW011DX / 15-BS013DX / HP ProBook 450 455 650 465 / HP Envy x360 15.6\" / HP Spectre x360 2-in-1 15.6\" / EliteBook / HP OMEN 15.6\" Laptop / ZBook 15 and etc. Lenovo: 15.6\" Lenovo IdeaPad Y700 / Lenovo Yoga 720 15.6\" / Legion Y520 Y720 / IdeaPad 110,320,520 / Lenovo Flex 4 15.6\" , Flex 5 15.6\"/Ideapad 100 - 15.6\",500 / G51, G50 , Z50 / Thinkpad L560, E560 , E570 15.6\" / T560, T540P / Lenovo Y50 and etc. Dell: Dell Inspiron 15 3000/Inspiron 15 5000/Inspiron 15 7000/New Latitude 15 5000/Latitude 15 3000/2018 Flagship Dell Inspiron 15.6\" and etc. Samsung： Samsung Notebook 5 , 7 / Samsung ATIV Book 9 Pro 15.6\" MSI:MSI GL62M 15.6\" 💚Available for most 15 - 15.6 Inch Laptops.",
        "average_rating": 4.6,
        "total_reviews": 354,
        "image_url": "https://m.media-amazon.com/images/I/41RBgBZC0KL._AC_.jpg"
    },
    {
        "product_id": "B014IYU6DY",
        "title": "3pcs 4 Wire 2 Phase DC Micro Stepper Motor Step Height 10mm with Output Gear",
        "brand": "Dowonsol",
        "category": "Electronics",
        "price": 6.99,
        "description": "Specifications: Motor diameter: 15 MM Motor height: 10 MM The output shaft diameter: 1.5 MM The output shaft length: 6 MM Motor: two phase four wire The step angle: 18 degrees Weight: 9 G",
        "average_rating": 1.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/410JJKBX8HL._AC_.jpg"
    },
    {
        "product_id": "B0C5XLH1HM",
        "title": "CoBak Case for Kindle Paperwhite - All New PU Leather Cover with Auto Sleep Wake Feature for Kindle Paperwhite Signature Edition and Kindle Paperwhite 11th Generation 2021 Released",
        "brand": "CoBak",
        "category": "Electronics",
        "price": 18.95,
        "description": "",
        "average_rating": 4.8,
        "total_reviews": 1064,
        "image_url": "https://m.media-amazon.com/images/I/31PT0Ih3hYL._AC_.jpg"
    },
    {
        "product_id": "B0BGMJX4RN",
        "title": "GIGABYTE AERO 16 XE5-16\" 4K/UHD+ Samsung AMOLED, Intel Core i7-12700H, NVIDIA GeForce RTX 3070 Ti Laptop GPU 8GB GDDR6, 32GB DDR5 RAM, 2TB SSD,Win11 Pro Laptop (AERO 16 XE5-73US948HP)",
        "brand": "Gigabyte",
        "category": "Electronics",
        "price": 1749.0,
        "description": "NVIDIA 30 Series GPU: NVIDIA GeForce RTX 3070 Ti Laptop GPU 8GB GDDR6, Boost Clock 1035 MHz, Maximum Graphics Power 105 W, Intel 12th Gen Ready: 12th Gen Intel Core i7-12700H (2.3GHz~4.7GHz), DDR5 Ready: DDR5 4800 16GB*2, 2x DDR5 Slots - Max 64GB, 2TB Storage, Cutting-Edge Display: 16\" Thin Bezel 4K/UHD+ 3840x2400 Samsung AMOLED Display, VESA DisplayHDR 500, 100% DCI-P3, Next Gen Interface: Windows 11 Pro, Intel Wi-Fi 6E AX210 (Gig+), Bluetooth V5.2, AERO Hub: External Adaptor with HDMI, miniDP, USB 3.1 Type-A, RJ45, Dynamic Audio: DTS:X Ultra Audio Technology, Built-in Microphone, 2x 2W Speakers, I/O: 2x Thunderbolt 4, 1x USB 3.2 Gen2 (Type-C), 1x 3.5mm Audio Combo Jack, 1x DC-in Jack",
        "average_rating": 3.3,
        "total_reviews": 10,
        "image_url": "https://m.media-amazon.com/images/I/41SCOtUbIgL._AC_.jpg"
    },
    {
        "product_id": "B00BGFTSGU",
        "title": "GGS Swivi HD DSLR LCD Universal Foldable Viewfinder Version II with 3.0X Magnification",
        "brand": "Swivi",
        "category": "Electronics",
        "price": 149.0,
        "description": "",
        "average_rating": 3.7,
        "total_reviews": 52,
        "image_url": "https://m.media-amazon.com/images/I/41BUv5PjMDL._AC_.jpg"
    },
    {
        "product_id": "B07XXVYW65",
        "title": "Kate 10x6.5ft Dark Wood Photo Backdrop for Photographers Horizontal Wooden Texture Floor Backgrounds for Studio Photo Props",
        "brand": "Kate",
        "category": "Electronics",
        "price": 78.0,
        "description": "Package Note: Background Stands or Lights not included. Package List: 1x Microfiber Photography Backdrop(Folding). Features: 1. No reflection, Light-proof compared to vinyl or other materials.2. Digital printed, the pattern is realistic and vivid.3. Washable and ironable, no need to worry about cleaning.4. Reusable and durable, once purchase for using several times.5. Seamless, we make sure the integrity of products and no joint on any backdrops. About Shipping: 1. Shipping time: Usually 3-5 days.2. If you do not receive your package for a long time, please contact with us immediately. Product Note: 1. If the backdrop has wrinkles, please hang to dry after washing with warm water or iron it.2. Perhaps it exists a little bit differences between pictures in the screen and real products due to the variation of your computer's color calibration.3. Please keep a proper distance while photographing. About Customization: If you would like to customize your personal backdrop, please tell us your requirements, email us the size and the patterns that you prefer as the attachment. Dear customer: Have any question,please feel free to contact us first. Thank you!",
        "average_rating": 3.5,
        "total_reviews": 8,
        "image_url": "https://m.media-amazon.com/images/I/51gk+QnYmPL._AC_.jpg"
    },
    {
        "product_id": "B087V6XHNV",
        "title": "Plugable USB C to HDMI Adapter 4K 30Hz, Thunderbolt 3 to HDMI Adapter Compatible with MacBook Pro, Windows, Chromebooks, 2018+ iPad Pro, Dell XPS, Thunderbolt 3 Ports and More",
        "brand": "Plugable",
        "category": "Electronics",
        "price": 21.95,
        "description": "",
        "average_rating": 4.3,
        "total_reviews": 142,
        "image_url": "https://m.media-amazon.com/images/I/31EoD-qIi9L._AC_.jpg"
    },
    {
        "product_id": "B00SK8LK1W",
        "title": "Adafruit FTDI Serial TTL-232 USB Cable [ADA70]",
        "brand": "Adafruit",
        "category": "Electronics",
        "price": 24.63,
        "description": "Just about all electronics use TTL serial for debugging, bootloading, programming, serial output, etc. But it's rare for a computer to have a serial port anymore. This is a USB to TTL serial cable, with a FTDI FT232RL usb/serial chip embedded in the head. It has a 6-pin socket at the end with 5V power and ground, as well as RX, TX, RTS and CTS at 3V logic levels. These are perfect for use with a Boarduino, Meggy's, or other Arduino clones and derivatives, and Fuzeboxen. Useful whenever you want to communicate with a TTL serial device, such as an XBee. New! We now have a version with a translucent body and RX/TX LEDs! Now it's easier than ever to debug your setup or see data transfer, the red and green LEDs will blink when data is transmitted/received by the FTDI chip. The version we have is the 3.3V. The data signals are at 3V and the power line provides 5V. We suggest this for any product that needs FTDI cables. Because the cable is 5V-logic compliant, you can use it with 3v or 5v logic just fine - no level shifting required!. If you have a device that is running at 5V logic and requires 5V power, this cable will work fine. If you want to tweak the voltages and signals a little, you should also check out the FTDI friend This cable is fully compatible with the TTL-232 cable from FTDI. You can download the drivers and the diagram / spec sheet which has mechanical cable details. For more details about the FT232RL itself, check out that datasheet here. Note: These use genuine FTDI chips, either we purchase them or they are manufactured to our specifications with the requirement of genuine FTDI chips 10/22/14",
        "average_rating": 4.5,
        "total_reviews": 67,
        "image_url": "https://m.media-amazon.com/images/I/41VxTkOnJ-L._AC_.jpg"
    },
    {
        "product_id": "B08XQ8PS2J",
        "title": "8x8ft Pink Rose Flower Theme Photography Backdrops 3D Pink Floral Newborn Kids Wedding Bridal Shower Photo Background Mother's Day Anniversary Ceremony Couple Photo Props Cake Table Banner",
        "brand": "XLL",
        "category": "Electronics",
        "price": 38.9,
        "description": "Details 1. The item color as the picture shown. 2. Made of vinyl cloth. Which is lightweight, thin, easy to carry, durable and wrinkle . 3. May have some creases, but it can be removed. 4. Cannot be washed. 5. Can be folded, easy to place. 6. Non-reflective. 7. The package just have one piece of backdrop. How to remove wrinkles (1)Hang naturally for a few days, no problem. (2) Heat it with a steam iron on the back of item, if necessary, please iron the back surface with steam iron but not dry iron. Then it will be smooth again. Warm-tip Because of the difference between the monitor and the light, here is normal that a slight difference in the color. The picture is clear, realistic, stereo sense is strong. Applications range: It can be used at many situations, such as getting together occasion, weddings,work,graduation,Birthday, Party，home photography any big events or decorations etc. If you have any questions please contact us. We will reply you as soon as possible. Thanks!",
        "average_rating": 4.5,
        "total_reviews": 358,
        "image_url": "https://m.media-amazon.com/images/I/61tRmYfaLDL._AC_.jpg"
    },
    {
        "product_id": "B003XT6OTG",
        "title": "LaCie Rugged All-Terrain Safe 500 GB USB 2.0/FireWire 800 Portable External Hard Drive 301491",
        "brand": "LaCie",
        "category": "Electronics",
        "price": 146.99,
        "description": "Product Description The LaCie Rugged Safe is the most complete mobile storage solution available. It offers multiple levels of data protection, from its unbreakable hardware encryption and the safest biometric authentication technology, to its shock-proof enclosure. Developed for users that need to protect their data against theft, the Rugged Safe boasts AES (Advanced Encryption Standard) 128-bit encryption. This is the same standard used by the U.S. government and organizations worldwide to protect critical documents. The Rugged Safe also features biometric authentication, which enables personalized data control, with access for to up to ten users. In addition to its enhanced security, the Rugged Safe comes with USB 2.0, FireWire 800/400, and is fully plug and play. Once configured, it grants access to authorized users on any Mac or PC with a single finger swipe, requiring no software installation. It’s also bus powered, making it the best solution for people on the go carrying sensitive data. From the Manufacturer The LaCie Rugged SAFE All-Terrain USB 2.0/ FireWire 800 Biometric Hard Disk is a complete mobile storage solution that has both outstanding performance and security for your most important and sensitive data. The Rugged SAFE provides 500 GB of storage, and features a durable enclosure with a rubber bumper that is designed to withstand the rigors of travel. The Rugged SAFE also provides multiple levels of data protection, including biometric authentication technology and hardware encryption. For users who demand that their data be safe, the Rugged SAFE drive is ideal. LaCie Rugged SAFE All-Terrain USB 2.0/ FireWire 800 Biometric Hard Disk Biometric authentication provides simple but strong security. View larger. Biometric Authentication and Data Encryption The LaCie Rugged SAFE All-Terrain Biometric Hard Disk features biometric authentication for up to ten users, enabling personalized data control. A fingerprint sensor is built into the top of the device, and users simply slide their fingers across it to gain access to the drive. After configuration, the drive grants access to authorized users on any Mac or PC with a single finger swipe, requiring no software installation. The Rugged SAFE also features AES (Advanced Encryption Standard) 128-bit encryption, the same encryption used by the U.S. government, and others around the world, to protect critical documents. With the Rugged SAFE, you'll be sure your data is secure. With three interfaces, you're sure to find a fast connection with any computer. View larger. Mobile, All-Terrain Protection Designed exclusively for LaCie by world-renowned designer Neil Poulton, the Rugged SAFE is built like an off-road vehicle, ready to withstand the bumps and bruises of your travels. Its unique, scratch-protected, aluminum shell and shock-resistant, rubber bumper make it especially resistant to harsh elements while giving it a stylish look. In fact, the drive is designed to withstand drops of up to 2.2 meters (86.6 inches) while in non-operating mode. (Dropping the drive while it's in operation, however, could cause damage.) Additional bumpers are available for purchase separately to change the look of the drive. Three Interfaces for Fast Connections The Rugged SAFE offers speed and versatility with three connection interfaces, letting you use it with almost any computer. The FireWire 800 interface allows for a blistering 800-Mbits/s data transfer speed, ideal for video editing and other intensive work. FireWire 400 is also supported, which has long been a favorite of Mac users and provides 400-Mbits/s speeds. The nearly universal USB 2.0 interface is supported as well, which offers a transfer rate of up to 480 Mbits/s, and is backwards compatible with USB 1.1. Measuring a mere 3.5 x 1.0 x 5.7 inches (W x H x D) and weighing less than 11 ounces, the Rugged SAFE is designed to travel and will fit easily in your briefcase or backpack. The disk is bus-powered and runs off either the FireWire or USB connection, eliminating the need for an AC adaptor. SAFE Utilities and Backup Software for Macs and PCs Included Preloaded on the drive are the LaCie SAFE Manager and the LaCie Backup Assistant software. LaCie SAFE Manager lets you customize your drive settings for different users. The LaCie Backup Assistant makes backing up your computer a breeze, whether it is a Mac or a PC. The LaCie Rugged SAFE All-Terrain USB 2.0/ FireWire 800 Biometric Hard Disk is backed by a 3-year limited warranty. About LaCie Established in France in 1989, LaCie is a leading manufacturer of computer peripherals for Windows, Apple and Linux users. With offices and plants in the USA, Canada, Japan, Australia, Europe, Singapore and Hong Kong, LaCie develops and manufactures external storage solutions and color monitors that help professionals and everyday people easily manage their digital lives. LaCie has differentiated its products through original designs and leading-edge technology. What's in the Box LaCie Rugged SAFE Hard Disk, FireWire 800 to 800 and 800 to 400 cables, USB 2.0 cable, USB power-sharing cable, Quick Install Guide, User Manual, LaCie Backup Assistant (Windows and Mac), LaCie SAFE Manager.",
        "average_rating": 3.2,
        "total_reviews": 18,
        "image_url": "https://m.media-amazon.com/images/I/31+90zPorvL._AC_.jpg"
    },
    {
        "product_id": "B00M9AEJQA",
        "title": "Monsoon G1/4\" to 1/2\" ID, 3/4\" OD Chain Gun Compression Fitting for Soft Tubing, Chrome, 4-Pack",
        "brand": "Monsoon",
        "category": "Electronics",
        "price": 25.71,
        "description": "",
        "average_rating": 5.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/51Cr-mlZCGL.jpg"
    },
    {
        "product_id": "B098ZFMY25",
        "title": "Aruba Instant On AP11 2x2 WiFi Access Point | US Model | Power Source Included (R3J21A)",
        "brand": "Aruba a Hewlett Packard Enterprise company",
        "category": "Electronics",
        "price": 109.99,
        "description": "",
        "average_rating": 4.4,
        "total_reviews": 119,
        "image_url": "https://m.media-amazon.com/images/I/21G7Rgd6+CL._AC_.jpg"
    },
    {
        "product_id": "B09J56DSX4",
        "title": "HEZOOMS DisplayPort to DisplayPort HDMI-Compatible Splitter Adapter MST SST Mode 8K@30Hz 4K@120Hz 1 in 2 Out Directional DP1.4 Splitter Dual Monitor for DP and HD Multi Screen simultaneous displays",
        "brand": "HEZOOMS",
        "category": "Electronics",
        "price": 39.99,
        "description": "",
        "average_rating": 4.0,
        "total_reviews": 12,
        "image_url": "https://m.media-amazon.com/images/I/41ycrbXkYUL._AC_.jpg"
    },
    {
        "product_id": "B06XKRXLDR",
        "title": "KHOMO - iPad 2 3 and 4 Generation Case - DUAL Series - Super Slim Black Cover with Rubberized back and Smart Auto Wake Sleep Feature for Apple iPad 2, 3rd and 4th.",
        "brand": "KHOMO",
        "category": "Electronics",
        "price": 11.95,
        "description": "KHOMO dual Series case choom introduces its best seller case for Apple iPad 2nd, 3rd and 4th Generation. The DUAL Series case continues to be an number one seller! The Ultra slim KHOMO dual case is the perfect choice for those who want a stylish and affordable way to protect their tablet. This chic, lightweight case has a polyurethane front cover and a hard rubberized poly-carbonate back protector. The rubberized poly-carbonate back ensures a firm grip while holding your tablet. 2 Year KHOMO with quick and easy KHOMO service. Check out the KHOMO accessories collection Known as the mobile & tablet accessories experts, KHOMO takes great pride in developing high quality, innovative designs that enhance and protect your valuable devices. Protect what you love with KHOMO top of the line accessories. We got you covered.",
        "average_rating": 4.5,
        "total_reviews": 2745,
        "image_url": "https://m.media-amazon.com/images/I/31+mP+y8UoL._AC_.jpg"
    },
    {
        "product_id": "B0C1Q7DP2X",
        "title": "trueCABLE Cat6A Shielded Riser (CMR), 1000ft, Green, 23AWG Solid Bare Copper, 750MHz, PoE++ (4PPoE), ETL Listed, Overall Foil Shield (FTP), Bulk Ethernet Cable",
        "brand": "TRUE CABLE",
        "category": "Electronics",
        "price": 318.99,
        "description": "",
        "average_rating": 4.8,
        "total_reviews": 450,
        "image_url": "https://m.media-amazon.com/images/I/419oDRi0g4L.jpg"
    },
    {
        "product_id": "B07GXM524L",
        "title": "Cookk Universal Folio Case for All 6.5-7.5 inch Tablet, Cookk PU Leather Bling Glitter [Card Slots] Stand Cover for Galaxy Tab 4, Galaxy Tab 3 Lite, Nexus 7, Touch M7, Rosegold",
        "brand": "Cookk",
        "category": "Electronics",
        "price": 14.99,
        "description": "Universal Folio Case Compatibility: Fits most of 6.5 to 7.5 inch tablet with android or windows or Linux Operating Systems. (Galaxy Tab A 7.0\" SM-T280/ Tab A6 7.0, Tab 4 7.0 SM-T280/T231/T235, Galaxy Tab 3 7.0 LTE GT-P3220, Galaxy Tab E Lite 7.0, Galaxy J 7.0, Tab 2 7.0 & 7.0 Plus P3100, Google Nexus 7, Nextbook Ares, FileMate Clear 7, Apex 7,  ClickN KIDS Tablet 2, Ematic EGQ307, FileMate Clear 7\"/ Clear X2 7\"/ Clear X4 7\", Hisense Sero 7 LT/ 7 Pro, HP Stream 7\",  Nextbook Ares 7 7, Nobis NB07, RCA 7 Voyager II,Visual Land Prestige Elite FamTab/ Prestige 7, Ematic EGQ307, FileMate Clear 7\"/ Clear X2 7\"/ Clear X4 7\", Hisense Sero 7 LT/ 7 Pro, HP Stream 7\", Nextbook Ares 7 7, Nobis NB07, RCA 7 Voyager II, Huawei Mediapad T3 7.0,  Visual LandPrestige Elite FamTab/ Prestige 7/ Prestige Elite 7Q/ Elite 7QS/ Prestige Pro 7D/ Pro 7DS/ Ematic HD and all 7 inch tablet. ) Feature: - Bulit In Stand with multiple viewing angles and easily to fold for a comfortable viewing position,It frees up your hands so you can enjoy movies, surf the Internet, conduct a presentation, view photos, read displayed sheet music etc. - The universal PU flip case is equipped with 4 clasps to well fix and protect your tablet PC from everyday tear and wear without affecting the normal use. - This case is wallet style design, have card slots and pocket, Card slot is designed for you to put debit card, credit card or ID card and so on. Packing Including: 1 x Universal Case for 6.5 - 7.5 inch Tablet 1 x Random Color Touch Screen Stylus Pen 1 x Cleaning Cloth Please kind note: No back camera opening.",
        "average_rating": 4.4,
        "total_reviews": 66,
        "image_url": "https://m.media-amazon.com/images/I/61VadnfYM6L._AC_.jpg"
    },
    {
        "product_id": "B0C3VJHW5Z",
        "title": "BORIYUAN iPad Mini 6 Keyboard Case 2021, 7 Colors Backlit Detachable Keyboard Slim Folio Smart Cover for iPad Mini 6th Generation 8.3 inch – Black",
        "brand": "BORIYUAN",
        "category": "Electronics",
        "price": 33.99,
        "description": "New iPad Mini 6 Keyboard Case 2021- Boriyuan 7 Colors Backlit Detachable Keyboard Slim Leather Folio Smart Cover with Pencil Holder for Apple iPad Mini 6th Gen 8.3\"(A2567/A2568/A2569), Support Apple Pencil Charging Description: - Slim, sturdy and attractive design.The iPad fits snugly into the case and provide sufficient protections for daily use. - Our iPad Mini 6th generation keyboard case comes with a slot for holding your Apple pencil stylus that lets you effortlessly reach for your pen whenever you want to use the touch pen function.(Apple Pencil is NOT included) - A protective cover and real, quiet keyboard support 3 use modes - Typing, Viewing, Reading - giving you amazing versatility. It allows you to prop the iPad up for watching videos.Ideal for school&home& work & travel. - All your ipad needs in one tool.The Folio Case takes mobile computing to a new level.Now you can enjoy laptop-like typing anywhere you take your iPad. Its slim design make it a joy to use anywhere, anytime. - The iPad Mini 6 Case Support apple pencil's magnetic attachment and wireless charging without taking off the case. - With the Auto Sleep/Wake Function ,When open the smart cover, your iPad instantly wakes up; when close it, your iPad automatically goes to sleep. You can press any key to wake the keyboard up. - Perfect access to all ports/buttons and camera. * How to connect the Bluetooth? * Make sure the keyboard fully charged(usually 4-5hours) before first using. * Turn on the keyboard. * Click \"\"fn\"\" + \"\"C\"\" to open the Bluetooth of the keyboard. * Turn on the Bluetooth of your iPad. * Find the \"\"Bluetooth 3.0 Keyboard\"\" and select it, the Bluetooth will be connected automatically. * Packing List: 1* iPad Case with Keyboard for iPad Mini 6 2021 8.3 inch 1* Micro USB 2.0 Cable (ONLY for the keyboard, NOT for iPad) 1* User Manual",
        "average_rating": 4.3,
        "total_reviews": 1417,
        "image_url": "https://m.media-amazon.com/images/I/51tPNfJ5JqL._AC_.jpg"
    },
    {
        "product_id": "B07CRKJRT2",
        "title": "Cuir Ally Women's Smart Clutch with Tracking Technology",
        "brand": "Cuir Ally",
        "category": "Electronics",
        "price": 99.99,
        "description": "",
        "average_rating": 4.0,
        "total_reviews": 18,
        "image_url": "https://m.media-amazon.com/images/I/3103+f+vtZL._AC_.jpg"
    },
    {
        "product_id": "B091THDX36",
        "title": "CPU Cooling Fan,CPU Cooler Heat Sink Cooling Fan for LGA2011 1366 1150 1151 1155 1156 Computer Supplies,CPU Heat Sink Fan with Strong Heat Dissipation",
        "brand": "Heayzoki",
        "category": "Electronics",
        "price": 23.9,
        "description": "Feature:  1. The aluminum alloy heat sink is used, and the heat dissipation area is large. 2. Using 4heat copper tube, high heat dissipation efficiency and fast heat dissipation. 3. 9cm cooling fan, strong wind, strong heat dissipation, convenient and practical. 4. This CPU cooling fan has a back plate and bracket for easy installation. 5. This CPU cooler is suitable for LGA2011 1366 11501151 1155 1156 platform.    Specification:    Item Type: CPU Cooler    Material: Aluminum alloy + copper tube  Fan Size: Approx. 9 x 9 x 2.5cm / 3.5 x 3.5 x 1in    Role: CPU heat dissipation  How To Use:   1. Disassemble the machine and install the back panel.  2. Install the CPU cooler and it can be used.            Package List:  1 x CPU Cooler 1 x Backplane  1 x Bracket  8 x Screw",
        "average_rating": 1.0,
        "total_reviews": 2,
        "image_url": "https://m.media-amazon.com/images/I/51kGagtIl0L.jpg"
    },
    {
        "product_id": "B0BPMGTV36",
        "title": "PHIXERO SATA to USB 3.0 Adapter for 2.5\" SSD/HDD with Protective Case, SATA to USB 5Gbps Support UASP for Samsung/Seagate/WD/SanDisk, USB to SATA Adapter Compatible with PC/Laptop/HD TV/PS5/PS4/Xbox",
        "brand": "PHIXERO",
        "category": "Electronics",
        "price": 10.99,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 37,
        "image_url": "https://m.media-amazon.com/images/I/41xVP8H5lCL._AC_.jpg"
    },
    {
        "product_id": "B08DP1YZP8",
        "title": "Bindpo Electronic Eyepiece,1.25 Inch Digital Telescope Eyepiece with USB Port, Electronic Eyepiece Camera Accessory for Astrophotography,640x480 Pixels, Compatible for PC/Laptop,",
        "brand": "Bindpo",
        "category": "Electronics",
        "price": 15.12,
        "description": "Specification:Condition: Brand NewMaterial: PlasticColor: BluePixel: 300,000CMOS Chip Type: Color CMOS Image SensorVideo Format: 24 bit RGBInterface: USB 2.0Lens Port: 1.25\" / 31.7mmVideo: 640x480 pixels up to 15 frame/sec(VGA)Frame Rate: 320x240 up to 30 frame/sec(CIF)S/N Ratio: less than 48dBDynamic Range: less than 72dBAutomatic white background balanceAutomatic color compensateWeight: Approx. 150gSystem Requirements:IBM PC or compatible PC or laptop with USB portPentium 200 or higher CPUWIN ME/2000/XP/7 Operating Systems20MB or higher remaining hard-disk space32MB or higher memorySupport DirectX VGA cardPackage List:1 * Electronic Eyepiece1 * Manual",
        "average_rating": 2.9,
        "total_reviews": 19,
        "image_url": "https://m.media-amazon.com/images/I/41qZUkNzawL._AC_.jpg"
    },
    {
        "product_id": "B09CL2VNPJ",
        "title": "rgzhihuifz 10 Pcs CR/LIR2450 Horizontal Coin Button Battery Holder Black Container Case",
        "brand": "rgzhihuifz",
        "category": "Electronics",
        "price": 6.25,
        "description": "Please pay attention to the Specification Table before purchasing, make sure our product is right what you want. ---Notes:Battery is not included here. PCB Horizontal type, for single CR/LIR2450 button battery. Output Voltage: 3V",
        "average_rating": 4.7,
        "total_reviews": 8,
        "image_url": "https://m.media-amazon.com/images/I/51zw1juPqNL._AC_.jpg"
    },
    {
        "product_id": "B0BXKWKH5Z",
        "title": "Kinmac 360° Protective Waterproof Laptop Case Bag Sleeve with Handle for MacBook Pro 16, and 15 inch-15.6 inch Laptop (Banana Leaf)",
        "brand": "Kinmac",
        "category": "Electronics",
        "price": 21.38,
        "description": "",
        "average_rating": 4.8,
        "total_reviews": 8699,
        "image_url": "https://m.media-amazon.com/images/I/51SGCz3G5vL._AC_.jpg"
    },
    {
        "product_id": "B00IKMJZVA",
        "title": "Assurant 2-Year Portable Electronics Protection Plan ($450-$499.99)",
        "brand": "Assurant",
        "category": "Electronics",
        "price": 9.81,
        "description": "From the Manufacturer",
        "average_rating": 5.0,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/41NVltLTG+L._AC_.jpg"
    },
    {
        "product_id": "B093GWXVC4",
        "title": "MonsDirect Case for Amazon Kindle Fire HD 8 & 8 Plus Tablet (Fit 2020 10th Generation) Slim Smart Auto Wake/Sleep Cover with Stand & Card Holder for All-New 2020 Fire HD 8/8 Plus, Beach",
        "brand": "MonsDirect",
        "category": "Electronics",
        "price": 18.99,
        "description": "Compatibility with: Designed specifically for 2020 Release 10th Generation All-New Amazon Kindle Fire HD 8 Tablet & Fire HD 8 Plus Tablet ONLY. The 2020 Kindle Fire HD 8 tablet & HD 8 Plus tablet size is 8.0''X5.4''X0.4'' NOT Fit New HD 8 Plus 11th Generation 2022 Release and Old HD 8 2016-2018 Release (8th / 7th / 6th Generation) / HDX7 / Fire 7\" / HD 10 / any other device. Slim and Lightweight: Lightweight case design protects your 2020 Fire HD 8 tablet without adding bulk. Auto Wake/Sleep Function: Magnet secures your device with straps covering the front. Support the auto Wake / Sleep function. Material: Made from durable synthetic leather with soft TPU interior to prevent your Fire HD 8 / HD 8 Plus tablet from finger prints,dirt and scratches. Stand Feature: Backside could be transformed into a kickstand, hands free for reading. Pen Slot & Interior Holder: Built-in elastic stylus holder. Thoughtful wallet design provides Several card slots for carrying credit card, ID card,cash and notes while on the go. Package Included: 1 * Synthetic Leather Smart Case for All-New 2020 Kindle Fire HD 8 Tablet & Fire HD 8 Plus Tablet",
        "average_rating": 4.6,
        "total_reviews": 390,
        "image_url": "https://m.media-amazon.com/images/I/51cZ6S+EXCL._AC_.jpg"
    },
    {
        "product_id": "B0BF9YKR59",
        "title": "Hermitshell Hard Travel Case for Microsoft Surface Slim Pen 1 or 2",
        "brand": "Hermitshell",
        "category": "Electronics",
        "price": 14.99,
        "description": "Hermitshell Hard Travel Case for Microsoft Surface Slim Pen 1 or 2",
        "average_rating": 4.7,
        "total_reviews": 8,
        "image_url": "https://m.media-amazon.com/images/I/41dl2ZmDGHL._AC_.jpg"
    },
    {
        "product_id": "B08RS4QZ2K",
        "title": "Amp Stand Black",
        "brand": "Generic",
        "category": "uncategorized",
        "price": 53.63,
        "description": "",
        "average_rating": 4.7,
        "total_reviews": 31,
        "image_url": "https://m.media-amazon.com/images/I/412XeTPwgRL._AC_.jpg"
    },
    {
        "product_id": "B08254WPLJ",
        "title": "MMOBIEL Ear Pads Cushions Compatible with Razer Kraken V2 Gaming Headset PU Leather (Black)",
        "brand": "MMOBIEL",
        "category": "Electronics",
        "price": 8.99,
        "description": "High quality Replacement earpads: Made off Premium Quality Comfortable Ultra Soft PU Leather Ear Cushions Earpads with Internal soft flexible memory Foam that effectively reduce and block the noise coming from outside for Optimal sound quality. Package includes: 2 Replacement Ear Cushions (headset is not Included). Easy Installation: Easy to install. Cushions align with mounting Post inside the headphone ear cups snap easily into place. Replace your previous ear pad cushions, and make your headphone look New. High quality product by MMOBIEL: Each parts are tested before shipment. Item in Stock!",
        "average_rating": 4.6,
        "total_reviews": 441,
        "image_url": "https://m.media-amazon.com/images/I/31RfwSnoKFL._AC_.jpg"
    },
    {
        "product_id": "B00KAEVW26",
        "title": "12V 8Ah Compatible Battery for APC RBC105 UPS - 8 Pack",
        "brand": "Mighty Max Battery",
        "category": "Electronics",
        "price": 149.99,
        "description": "",
        "average_rating": 5.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/41tFINopJXL.jpg"
    },
    {
        "product_id": "B005T6TJIO",
        "title": "MEAN WELL SE-1000-24 AC-DC Power Supply Single Output 24V 41.7 Amp",
        "brand": "MEAN WELL",
        "category": "Electronics",
        "price": 212.52,
        "description": "1000W single output power supply output: 24Vdc 0-41.7a rated output power: 1000.8W protections: short circuit/overload/over voltage/over temperature AC input active surge current limiting built-in remote on-off control built-in remote sense function dimensions: 278*127*63.5mm (l*w*h) detailed specifications: primary output voltage (VDC): 24 output current (a): 41.7 maximum output power (W): 1000.8 family: se-1000 input voltage (VAC): 115 & 220 input frequency: 47 to 63 maximum input current (a): 17.5 output connector Type: Lug terminal female number of outputs: 1 product Type: AC to DC power supply efficiency ( percent ): 88 minimum isolation voltage: 3000V operating temperature-min (CEL): -20 operating temperature-max (CEL): 60 Length (inch): 10.9 width (inch): 5 height (inch): 2.5 agency approvals: UL color: silver Type: switch selectable style: enclosed.",
        "average_rating": 2.7,
        "total_reviews": 5,
        "image_url": "https://m.media-amazon.com/images/I/41aUiMn0C2L.jpg"
    },
    {
        "product_id": "B00XHY9YTE",
        "title": "Metra GMOS-LAN-04 GMOS-LAN Interface GM 06-08",
        "brand": "Metra",
        "category": "Electronics",
        "price": 117.99,
        "description": "GMLAN OnStar Interface The GMOS-LAN-04 interface is designed to allow the user to replace the OEM radio with an aftermarket unit in amplified 2006-up Chevrolet HHR, Pontiac Solstice, and Saturn Sky that use the new GMLAN data bus system and retains full functionality of the OnStar system as well as all safety and warning chimes. The GMOS-LAN-04 will also retain the retained accessory power convenience features. This interface has the capability of adjusting chime and OnStar volumes as well. In addition to these features, the GMOS-LAN-04 now has the required outputs for the installation of a navigation radio. This product fits the following vehicles: CHEVROLET Cobalt 2007 2010 CHEVROLET HHR 2006 2011 CHEVROLET Malibu 2008 2012 PONTIAC G5 2007 2009 PONTIAC G6 2009 2010 PONTIAC Solstice 2006 2009 SATURN Aura 2007 2009 SATURN Sky 2007 2009",
        "average_rating": 4.3,
        "total_reviews": 54,
        "image_url": "https://m.media-amazon.com/images/I/414zn6bkz7L._AC_.jpg"
    },
    {
        "product_id": "B07N1WJXTY",
        "title": "3 MFD 100V Mylar Non-Polarized Crossover Capacitor",
        "brand": "GOLDWOOD",
        "category": "Electronics",
        "price": 1.99,
        "description": "Premium quality Mylar based caps for audiophile quality crossover. Non-polarized axial leads. 3uf @ 100V.",
        "average_rating": 5.0,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/31e6siFuH6L._AC_.jpg"
    },
    {
        "product_id": "B000AQ8OFC",
        "title": "Power Acoustik XPS-104 4\" Midrange 300W Speaker",
        "brand": "Power Acoustik",
        "category": "Electronics",
        "price": 17.99,
        "description": "We are an authorized Power Acoustik dealer! The Power Acoustik XPS-104 4\" mid-range speaker features a max power of 120 watts and a RMS of 60 watts. Other features include 4-ohm impedance, 92dB efficiency and a magnet weight of 15 oz. Grill Included. 1 Year Manufacturer Warranty.",
        "average_rating": 4.2,
        "total_reviews": 94,
        "image_url": "https://m.media-amazon.com/images/I/41wCYpgsvAL._AC_.jpg"
    },
    {
        "product_id": "B09WV945TZ",
        "title": "LOVEVOOK Laptop Backpack for Women Work Travel Backpack College Backpack Purse Business Commuter Computer Bag Teacher Doctor Nurse Bags, 15.6 Inch, Blue-black",
        "brand": "LOVEVOOK",
        "category": "Electronics",
        "price": 39.98,
        "description": "",
        "average_rating": 4.7,
        "total_reviews": 1375,
        "image_url": "https://m.media-amazon.com/images/I/41RARtAliLL._AC_.jpg"
    },
    {
        "product_id": "B0B7WT4RZK",
        "title": "Aiminu USB C to Lightning Cable 6ft 2Pack, Fast iPhone Charger MFi Certified Power USB C iPhone Cable Braided Type C iPhone Charging Cord for iPhone 13 12 11 Pro Max X XS XR 8 7 6s Plus SE, iPad-Red",
        "brand": "Aiminu",
        "category": "Electronics",
        "price": 10.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 5763,
        "image_url": "https://m.media-amazon.com/images/I/41nflwR4WWL._AC_.jpg"
    },
    {
        "product_id": "B01N1TCT1Z",
        "title": "AK Bands Compatible with Fitbit Alta HR Bands, Genuine Leather Adjustable Comfortable Wristbands for Fitbit Alta HR/Fitbit Alta",
        "brand": "AK",
        "category": "Electronics",
        "price": 10.99,
        "description": "AK Replacement Fitbit Alta Band / Fitbit Alta HR Band Leather Wristband for Fitbit Alta Fitness Tracker Material Type: AK Fitbit Alta HR/Alta band Made of genuine leather with metal buckle, providing you a comfortable wearing experience when doing sport, working or outdoor Compatibility Type: Fit for Fitbit alta fitness tracker ONLY, Not fit for any other fitbit tracker. Color Option: More color choices than original Fitbit Alta Band / Fitbit Alta HR bands, you can choose AK replacement fitbit alta / alta hr bands leather in color Black, Coffee Brown, Brown, Red, Orange Brown, Weave Gray, Brown Bamboo Texture and Matte Gray Alta band to dress up your Fitbit alta / Fitbit Alta HR and fit with your daily wear and mood. Size option: Free size, AK Adjustable Replacement fit bit Alta/alta hr band wrist size: 5.5 inch – 8.1 inch. No trouble to choose whether you should buy large size or small size. This Fitbit Alta Band size can be freely adjusted according to the circumstance of individual wrist. Package Include: 1 x AK Fitbit alta band replacement for your Fitbit alta HR fitness tracker, Fit bit Alta fitness tracker is NOT included After-sale service: If there is any issue about our product, please feel free to contact us. We will try our best to help you solve this problem.",
        "average_rating": 4.5,
        "total_reviews": 1379,
        "image_url": "https://m.media-amazon.com/images/I/51L78ZGThJL._AC_.jpg"
    },
    {
        "product_id": "B0067HY1EQ",
        "title": "Tiffen 77mm Photo Essentials Kit with UV Protector, 812 Color Warming, Circular Polarizing Glass Filters and 4 Pocket Pouch",
        "brand": "Tiffen",
        "category": "Electronics",
        "price": 89.99,
        "description": "Product Description This kit consists of a: a UV Protection filter, an 812 Warming filter, a circular polarizer and 4-pocket filter pouch. UV Protection Filters Haze(UV) filters are wise initial investments. They help protect your valuable investment from dust, moisture and scratches, which can lead to costly repairs. If desired they can be left on the lens at all times for protection. Haze filters provide additional benefits of correction for Ultraviolet(UV) light which can register on film and videotape as a bluish cast and can obscure distant details. Ultraviolet filters allow you to correct for the UV effect to varying degrees. 812 Filters Tiffen's exclusive 812 Filter improves skin tones and is ideal for portraits taken on a cloudy day or outdoors in shade on a sunny day. It also absorbs blue cast often caused by electronic flash and adds warmth to pale washed-out flesh tones. Circular Polarizers Light rays which are reflected become polarized. Polarizing filters are used to select which light rays enter your camera lens. They can remove unwanted reflections from non-metallic surfaces such as water or glass and also saturate colors providing better contrast. The effect can be seen through the viewfinder and changed by rotating the filter. The filter factor varies according to how the filter is rotated and its orientation to the sun. Filter factor is between 2.3 and 2.8 (approx. +1.3 stops). Circular polarizers are specifically designed for use with auto-focus SLR cameras (They will also work on manual systems and video cameras without problems). Amazon.com The prepackaged assortments provide a range of artistic possibilities.",
        "average_rating": 4.6,
        "total_reviews": 576,
        "image_url": "https://m.media-amazon.com/images/I/41DCE1ACFHL._AC_.jpg"
    },
    {
        "product_id": "B0753Y5RTG",
        "title": "Digipartspower +16V + 32V AC DC Adapter for HP Photosmart 2575 2575V 2575xi Q3020A 5550v All-in-One Printer Scanner Copier Power Supply Cord Cable Charger",
        "brand": "Digipartspower",
        "category": "Electronics",
        "price": 17.85,
        "description": "Notice: 1. Please make sure the DC output and tip size of ac adapter are accordant before you order. 2. If you use the adapter for a long time, please keep it suitable ventilating and humidity. Do not put it on the skin products. Service Information: For your own interests and safety, if there is any abnormal condition when using the product, please stop using it immediately and contact with our customer service center How to contact us? You can contact us directly from Your Account. Locate the order and click the \"Problem with this order?\" button.  Then select the \"Contact Seller\" button to send us an e-mail message. We would be glad to solve any problem for you within 24 hours.  Your support to our business and your patience on the matter will be really appreciated. Warranty: 30 Days Money Back Guarantee / 60 Days Free Exchange With Paid Return Label / 360 Days Anytime Worry-Free Warranty! / Please contact us with any questions or concerns - we are here to help!",
        "average_rating": 5.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/41iEGY-1FvL._AC_.jpg"
    },
    {
        "product_id": "B008GYKN68",
        "title": "Kastar NPBN1 Battery and Charger Kit for Sony NP-BN1 N Type Battery and Sony Cybershot DSC-TX5 DSC-TX7 DSC-TX9 DSC-WX30 DSC-WX50 DSC-WX70 DSC-WX9 DSC-QX10 DSC-QX100 DSC-TX10 DSC-TX20 DSC-TX30 Cameras",
        "brand": "Kastar",
        "category": "Electronics",
        "price": 10.99,
        "description": "1. Compatible with battery models: Sony NP-BN1 Sony Type N 2. Compatible with charger models: Sony BC-CSN BC-CSNB 3. Compatible with camera models: Sony Cyber-shot DSC-J10 Sony Cyber-shot DSC-QX10 Sony Cyber-shot DSC-QX30 Sony Cyber-shot DSC-QX100  Sony Cyber-shot DSC-T99 Sony Cyber-shot DSC-T110  Sony Cyber-shot DSC-TF1 Sony Cyber-shot DSC-TX5 Sony Cyber-shot DSC-TX7 Sony Cyber-shot DSC-TX9 Sony Cyber-shot DSC-TX10 Sony Cyber-shot DSC-TX20 Sony Cyber-shot DSC-TX30 Sony Cyber-shot DSC-TX55 Sony Cyber-shot DSC-TX66 Sony Cyber-shot DSC-TX100V Sony Cyber-shot DSC-TX200V  Sony Cyber-shot DSC-W310 Sony Cyber-shot DSC-W320 Sony Cyber-shot DSC-W330 Sony Cyber-shot DSC-W350 Sony Cyber-shot DSC-W360 Sony Cyber-shot DSC-W380 Sony Cyber-shot DSC-W390 Sony Cyber-shot DSC-W510 Sony Cyber-shot DSC-W515PS Sony Cyber-shot DSC-W520 Sony Cyber-shot DSC-W530 Sony Cyber-shot DSC-W550 Sony Cyber-shot DSC-W560 Sony Cyber-shot DSC-W570 Sony Cyber-shot DSC-W580 Sony Cyber-shot DSC-W610 Sony Cyber-shot DSC-W620 Sony Cyber-shot DSC-W630 Sony Cyber-shot DSC-W650 Sony Cyber-shot DSC-W670 Sony Cyber-shot DSC-W690 Sony Cyber-shot DSC-W710 Sony Cyber-shot DSC-W730 Sony Cyber-shot DSC-W800 Sony Cyber-shot DSC-W810 Sony Cyber-shot DSC-W830  Sony Cyber-shot DSC-WX5 Sony Cyber-shot DSC-WX7 Sony Cyber-shot DSC-WX9 Sony Cyber-shot DSC-WX10 Sony Cyber-shot DSC-WX30 Sony Cyber-shot DSC-WX50 Sony Cyber-shot DSC-WX60 Sony Cyber-shot DSC-WX70 Sony Cyber-shot DSC-WX80 Sony Cyber-shot DSC-WX100 Sony Cyber-shot DSC-WX150 Sony Cyber-shot DSC-WX200 Sony Cyber-shot DSC-WX220",
        "average_rating": 4.0,
        "total_reviews": 94,
        "image_url": "https://m.media-amazon.com/images/I/413Y9vY4avL._AC_.jpg"
    },
    {
        "product_id": "B0BNHVJ8NX",
        "title": "Universal Firestick Remote Cover Glow in The Dark - TV Stick 4k Remote Cover 2nd/3rd Gen, Firestick Remote Case Anti Slip Silicone Sleeve (Blue )",
        "brand": "GMXT",
        "category": "Electronics",
        "price": 5.99,
        "description": "",
        "average_rating": 4.2,
        "total_reviews": 36,
        "image_url": "https://m.media-amazon.com/images/I/41ZZT6pMxUL._AC_.jpg"
    },
    {
        "product_id": "B08TLSB7WL",
        "title": "GOHIGH Lens Replacement for GoPro Hero 9 Black, Protective Lens Glass Cover Action Camera Accessories Repair Part",
        "brand": "GOHIGH",
        "category": "Electronics",
        "price": 10.92,
        "description": "",
        "average_rating": 4.1,
        "total_reviews": 21,
        "image_url": "https://m.media-amazon.com/images/I/310CO7Im3GL._AC_.jpg"
    },
    {
        "product_id": "B00K0LAPDQ",
        "title": "Pyle PLPW12D 12\" 3200W 4-Ohm DVC Car Subwoofer Sub 2 Pack w/ DVC 4 Ohm Impedance, Black Steel Basket, & Non Press Paper Cone and Dual Ported Enclosure",
        "brand": "Pyle",
        "category": "Electronics",
        "price": 166.99,
        "description": "**Package Includes:**<br> 2 x Pyle PLPW12D 12\" 1600W Subwoofers<br> 1 x Q POWER 12\" Dual Vented Subwoofer Enclosure The **Pyle PLPW12D** small enclosure unit will add extra punch to your low end and give you that huge sound you want. The sound is produced by a 2 Inch 4 layer high temperature dual voice coil with 60 oz. heavy duty magnet, pushing 1,600 watt (3200W per pair) MAX power. It’s all housed in a stamped steel basket for durability. Your booming sound is enhanced by the wide, non fatiguing rubber suspension, specially designed rubber magnet boot, non press cone, specially treated foam surround, along with bumped and vented motor construction that keeps your equipment safe and extends the life of the subwoofer. If you are looking for a clean cut, powerful, and versatile new sound, Pyle has your audio solution. Add performance and quality enhancement to your audio system with high quality and rugged subwoofers. The **Q POWER 12\"** Dual Heavy Duty Vented Subwoofer Enclosure features solid 5/8\" MDF construction, charcoal carpet covering, a dual vented design, and terminal cup connectors. Turn your ride into a sound machine with the help of the Q POWER 12\" Dual Heavy Duty Vented Subwoofer Enclosure! **We are an authorized Pyle & Q Power dealer**",
        "average_rating": 3.8,
        "total_reviews": 57,
        "image_url": "https://m.media-amazon.com/images/I/41q-9x0XSCL._AC_.jpg"
    },
    {
        "product_id": "B01MZA1AB2",
        "title": "Intel Dual Band Wireless-Ac 8265 w/Bluetooth 8265.NGWMG",
        "brand": "Intel",
        "category": "Electronics",
        "price": 20.0,
        "description": "INTEL WIFI WIRELESS-AC 8265 8265.NGWMG DUAL BAND 2X2 AC + BLUETOOTH M.2 BROWN BO",
        "average_rating": 4.6,
        "total_reviews": 618,
        "image_url": "https://m.media-amazon.com/images/I/51DuEWGzGBL._AC_.jpg"
    },
    {
        "product_id": "B08GQ2VHQ6",
        "title": "Lightdow 420-800mm f/8.3 Manual Zoom Super Telephoto Lens + T Mount Ring for Nikon D3500 D5600 D7500 D500 D600 D700 D750 D800 D850 D3200 D3400 D5100 D5200 D5300 D7000 D7200 Camera (White Version)",
        "brand": "Lightdow",
        "category": "Electronics",
        "price": 96.99,
        "description": "",
        "average_rating": 3.7,
        "total_reviews": 398,
        "image_url": "https://m.media-amazon.com/images/I/31p3ynZblvL._AC_.jpg"
    },
    {
        "product_id": "B07WZT643Q",
        "title": "Charger for MacBook Pro 10FT, 96W USB C Charger Power Adapter for MacBook Pro 16, 15, 14, 13 inch 2023, 2022 2021, 2020, 2019, M1 M2 MacBook Air, LED, 5A USB-C Cable Charging as Fast as MagSafe 3",
        "brand": "IFEART",
        "category": "Electronics",
        "price": 35.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 2141,
        "image_url": "https://m.media-amazon.com/images/I/21QlbdFXAGL._AC_.jpg"
    },
    {
        "product_id": "B00AZOIG9I",
        "title": "BM Premium 2-Pack of NP-85 Batteries and Charger Kit for FujiFilm FinePix S1 SL240 SL260 SL280 SL300 SL305 SL1000 Digital Camera",
        "brand": "BM Premium",
        "category": "Electronics",
        "price": 22.99,
        "description": "Bring your digital camera back to life with a new battery. Make sure you never miss another once-in-a-lifetime moment by having a new NP-85 battery specifically designed for your Fujifilm FinePix digital cameras. BM Premium rechargeable batteries are engineered to meet or exceed OEM specifications and feature the latest battery technology, including advanced circuitry, voltage regulation, and thermal circuit protection. Battery includes a one-year warranty. Battery is compatible with the following cameras: FinePix SL240  FinePix SL260  FinePix SL280  FinePix SL300  FinePix SL305  FinePix SL1000 Kit Includes: Qty 2 BM Premium NP-85 Batteries Qty 1 Battery Charger for NP85 Battery",
        "average_rating": 4.7,
        "total_reviews": 345,
        "image_url": "https://m.media-amazon.com/images/I/41S7Xqs6HcL._AC_.jpg"
    },
    {
        "product_id": "B09H2JQD48",
        "title": "KECOP Baby Pink USB Wire Keyboard with Rainbow LED Backlight Full 104 Keys Water-Resistant Mechanical Feeling Game Keyboard for Desktop, Computer, PC (Baby Pink)",
        "brand": "KECOP",
        "category": "Electronics",
        "price": 23.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 27,
        "image_url": "https://m.media-amazon.com/images/I/41GWM+qGAOL._AC_.jpg"
    },
    {
        "product_id": "B0B6SQMZ4P",
        "title": "KKstorm School Headset for School: Student Headphones Bulk for Classroom Headphones Class Set Bulk Order of Headphones Class Sets of Headphones for Students (Green)",
        "brand": "KKstorm",
        "category": "Electronics",
        "price": 19.64,
        "description": "",
        "average_rating": 3.5,
        "total_reviews": 35,
        "image_url": "https://m.media-amazon.com/images/I/31Yd6YaIVjL._AC_.jpg"
    },
    {
        "product_id": "B07G5TWZXK",
        "title": "Samyang 24mm F/2.8 Prime Fixed Auto Focus Wide Angle Lens, Black (SYIO24AF-E)",
        "brand": "Samyang",
        "category": "Electronics",
        "price": 219.0,
        "description": "The Samyang AF 24mm F2.8 compact lens is the newest addition to Samyang's series of highly popular full frame auto focus lenses for Sony E mount cameras. This 24mm offers outstanding image quality, a wider view than the Samyang 35mm F2.8, and a fast and quiet auto focus system. The new Samyang 24mm F2.8 lens is designed specifically for Sony full frame mirrorless cameras with a focus on three main features: optical quality, portability, and silent autofocus. Thanks to advanced manufacturing techniques, Samyang now offers a wider angle view without sacrificing quality or performance. Optically, the lens is made up of 7 elements in 7 groups. Its construction has been optimally arranged for portability and to deliver high resolution from the center to the corners of the image. 3 aspherical/2 high refractive Index elements and Samyang's Ultra multi-coating techniques are utilized to minimize chromatic aberrations and unnecessary light dispersion. Quiet, fast and accurate auto focusing make this lens perfect for stealthy street shooting. Its weight of just about 3.3oz and its inconspicuous size make it ideal for travel. A minimum focusing distance of 9.5” and a substantial wide angle of view will make this Samyang full frame lens the go to lens for astrophotography and landscape photography. For the Sony Alpha a6000/a5000 series or other Sony APS-C cameras, the lens is equivalent to approximately 36mm, providing the same features with a more moderate wide angle of view.",
        "average_rating": 4.4,
        "total_reviews": 105,
        "image_url": "https://m.media-amazon.com/images/I/41dGqFiGMML._AC_.jpg"
    },
    {
        "product_id": "B09X983942",
        "title": "Macally 2.4G USB Wireless Keyboard for Laptop or Computer - Keep it Simple - Full Size Keyboard with Numeric Keypad & 13 Shortcut Keys - Plug and Play PC Keyboard Wireless - White Keyboard Cordless",
        "brand": "Macally",
        "category": "Electronics",
        "price": 19.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 3095,
        "image_url": "https://m.media-amazon.com/images/I/41131SYREkL._AC_.jpg"
    },
    {
        "product_id": "B0BMXFDSKM",
        "title": "HP 15.6\" Micro-Edge HD Laptop, Intel Core i3-1115G4 up to 4.1GHz (Beat i5-1035G4), 16GB RAM, 512GB PCIe SSD, Wi-Fi 6, Lightweight, Bluetooth, Webcam, Fast Charge, 11 Hours Battery Life, HDMI, Win11",
        "brand": "HP",
        "category": "Electronics",
        "price": 599.0,
        "description": "We sells computers with upgraded configurations. If the computer has modifications (listed above), then the manufacturer box is opened for it to be tested and inspected and to install the upgrades to achieve the specifications as advertised. If no modifications are listed, the item is unopened and untested. Defects & blemishes are significantly reduced by our in depth inspection & testing. Processor: Intel Core i3-1115G4 (up to 4.1 GHz with Intel Turbo Boost Technology, 6 MB L3 cache, 2 cores, 4 threads) Memory: 16GB DDR4 RAM Graphics: Intel UHD Graphics Storage: 512GB PCIe SSD Display: 15.6\" diagonal, HD (1366 x 768), micro-edge, BrightView, 250 nits, 45% NTSC Connectivity: Realtek RTL8821CE-M 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 combo Expansion slots: 1 multi-format SD media card reader Ports: 1 SuperSpeed USB Type-C 5Gbps signaling rate 2 SuperSpeed USB Type-A 5Gbps signaling rate 1 HDMI 1.4b 1 AC smart pin 1 headphone/microphone combo Power supply: 45 W Smart AC power adapter Battery: 3-cell, 41 Wh Li-ion Webcam: HP True Vision 720p HD camera with integrated dual array digital microphones Audio: Dual speakers How to switch s mode to windows 11 1. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.) 3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.",
        "average_rating": 4.2,
        "total_reviews": 16,
        "image_url": "https://m.media-amazon.com/images/I/41od9e6g4kL._AC_.jpg"
    },
    {
        "product_id": "B0029L7IYY",
        "title": "Technical Pro C-QS-1225 25' 1/4\" to Speakon Speaker Cable, 12 Gauge",
        "brand": "Technical Pro",
        "category": "Electronics",
        "price": 15.95,
        "description": "Available in 12 and 16 gauge speaker wire. Available in 25 and 50 feet.",
        "average_rating": 4.4,
        "total_reviews": 11,
        "image_url": "https://m.media-amazon.com/images/I/41TUC1ja92L._AC_.jpg"
    },
    {
        "product_id": "B00AOBL7H0",
        "title": "Pwr Computer Monitor TV Replacement Power Cord - 6-Foot",
        "brand": "PWR+",
        "category": "Electronics",
        "price": 9.99,
        "description": "power cables",
        "average_rating": 5.0,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/41mSV6z6NlL._AC_.jpg"
    },
    {
        "product_id": "B08BCB52MR",
        "title": "50Pcs Ocean Animal Stickers for Kids Teen, Waterproof Decal for Hydro Flask Water Bottle Laptop Skateboard Computer Phone Bike Luggage Helmet, Cute Fashion Girl Gift - Marine Life",
        "brand": "RUBANG",
        "category": "Electronics",
        "price": 6.99,
        "description": "How to use? 1.Think about where you want to paste 2.Clean the surface of the object 3.Tear off the bottom paper 4.Firmly stick the sticker on the surface of the object, leaving no gaps 5.If not properly pasted,You can tear it up and paste it again",
        "average_rating": 4.7,
        "total_reviews": 65,
        "image_url": "https://m.media-amazon.com/images/I/61TQ97cnxLL._AC_.jpg"
    },
    {
        "product_id": "B087NHW5FZ",
        "title": "GearFend Dust Cleaner Strong Cleaning Air Blower for All DSLR Camera & Camcorders, Lens, LCD Screens, etc + Microfiber Cloth",
        "brand": "GearFend",
        "category": "Electronics",
        "price": 4.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 783,
        "image_url": "https://m.media-amazon.com/images/I/31Ay1Dn8RrL._AC_.jpg"
    },
    {
        "product_id": "B00XIMZT8A",
        "title": "Absolute C15LGR 15-Feet Long/4-Feet Wide Light Grey Carpet for Speaker Sub Box Carpet rv Truck Car Trunk Laner",
        "brand": "Absolute",
        "category": "Electronics",
        "price": 49.99,
        "description": "Absolute C15LGR 15-Feet Long/4-Feet Wide Light Grey Carpet for Speaker Sub Box carpet rv Truck Car Trunk Laner",
        "average_rating": 3.4,
        "total_reviews": 22,
        "image_url": "https://m.media-amazon.com/images/I/41WvQvhukqL._AC_.jpg"
    },
    {
        "product_id": "B09H2Z9MFL",
        "title": "Alapmk Protective Cover Case for 11.6\" ASUS Chromebook CX1 CX1100CNA CX1100CNA-AS42/Dell Inspiron 11 2-in-1 3195 i3195 Laptop[Not fit Dell Inspiron 11 2-in-1 3168 3169 3179 3185],Galaxy",
        "brand": "Alapmk",
        "category": "Electronics",
        "price": 22.99,
        "description": "",
        "average_rating": 4.2,
        "total_reviews": 57,
        "image_url": "https://m.media-amazon.com/images/I/51DbXdjtHHL._AC_.jpg"
    },
    {
        "product_id": "B07Y8T5GTV",
        "title": "AIUNIT Compatible with Alta HR and Alta Band, Replacement Accessories Bands Siilicon Sport Wristbands/Metal Bands Small Large for Alta Ace Fitness Tracker Women Men",
        "brand": "AIUNIT",
        "category": "Electronics",
        "price": 9.99,
        "description": "Description: 1. The replacement band is for your Alta HR or Alta Tracker. 2. Personalized your Alta with this refined alta replacment band. 3. Delighted varied colors personalize your wristband to fit your mood and outfit in daily life. 4. The wristband is made of a flexible, durable premium material which is hypoallergenic and provides comfortable wearing experience.",
        "average_rating": 4.2,
        "total_reviews": 279,
        "image_url": "https://m.media-amazon.com/images/I/51nw-2h9JgL._AC_.jpg"
    },
    {
        "product_id": "B0743MQB7N",
        "title": "PlatinumPower AC Power Cord Cable for Sony Boombox CFD-S38, CFD-S39, CFD-S55",
        "brand": "PLATINUM DELUX",
        "category": "uncategorized",
        "price": 8.99,
        "description": "",
        "average_rating": 1.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/41OzWEsiRPL._AC_.jpg"
    },
    {
        "product_id": "B018UK9Y6M",
        "title": "Bluelounge Mika, White",
        "brand": "Bluelounge",
        "category": "Electronics",
        "price": 19.99,
        "description": "A truly universal stand, Mika is compatible with devices ranging from the Nexus 7 to the iPad, and even the MacBook Air or Retina MacBook Pro. It provides the perfect resting place for your tablet or laptop, keeping your workspace neat and tidy and ready for whatever the day holds.",
        "average_rating": 3.9,
        "total_reviews": 10,
        "image_url": "https://m.media-amazon.com/images/I/21UYJ-cdIKL._AC_.jpg"
    },
    {
        "product_id": "B0BJ7F4W33",
        "title": "Mini Voice Activated Recorder, Lightweight Aluminium Case, 26 Hours Recording Battery Time, for Lectures, Meetings, Classes and More - by aTTo Digital",
        "brand": "attodigit@l",
        "category": "Electronics",
        "price": 55.57,
        "description": "",
        "average_rating": 4.8,
        "total_reviews": 10,
        "image_url": "https://m.media-amazon.com/images/I/31W2GmE-6VL._AC_.jpg"
    },
    {
        "product_id": "B0B9GX98SX",
        "title": "ANTOGOO V Tempered Glass Screen Protector Compatible with MacBook Pro 14 inch 2021 M1 Chip(A2442), 9H Hardness/No Bubble/Clear",
        "brand": "ANTOGOO V",
        "category": "Electronics",
        "price": 6.99,
        "description": "",
        "average_rating": 3.0,
        "total_reviews": 2,
        "image_url": "https://m.media-amazon.com/images/I/31jo9YyfL-L._AC_.jpg"
    },
    {
        "product_id": "B01EJZFUFG",
        "title": "The Goliath Extra Large Drop Over Cable Protector - 2 Channel (2 Pack)",
        "brand": "Electriduct",
        "category": "Electronics",
        "price": 199.99,
        "description": "When standard drop over style cable protectors do not offer enough protection for your application, step up to The Goliath Drop Over Cable Ramps. Designed with size and cost in mind. This extra large cable cover features a 2 channel unit will fit 2\" cables or hoses & both with a load capacity of 4,000 lbs. Constructed out of dense recycled rubber material combined with a sturdy design, the Goliath Drop Over will support light vehicle traffic such as cars and SUV's. Integrated connectors allows for unlimited cable run protection and although the great traction due to weight and material, this drop over has mounting holes for permanent installation. *The Extra Large 2 Channel Goliath has built in 'mounting holes' *All dimensions may vary by +/- 2% *Not intended for constant vehicle traffic.",
        "average_rating": 4.9,
        "total_reviews": 14,
        "image_url": "https://m.media-amazon.com/images/I/51I+N9Yln6L._AC_.jpg"
    },
    {
        "product_id": "B005DL1IJS",
        "title": "4Keyboard Korean Japanese Hiragana Stickers for Keyboard with Blue and Yellow Lettering Transparent Background",
        "brand": "4Keyboard",
        "category": "Electronics",
        "price": 2.79,
        "description": "High-quality stickers for different keyboards Desktop, Laptop and Notebook. The Korean - Japanese Hiragana Alphabet is spread onto transparent - matt sticker, with blue and yellow color lettering which are suitable for all dark keyboards. Applying stickers on you keyboard properly once, and you can be aware that letters will stay for ever. Transparency and matt hue of the stickers is suitable for all kind of keyboards in spite of their color. It guarantees complete absence of glare under different angels of lighting. Clear transparent background makes stickers invisible, and allows existing characters to show through. You do not have to think how to apply Stickers. You'll know it intuitively. English letters located underneath each sticker - will accurately indicate buttons on with you will apply corresponding stickers. Applying possess doesn't take more than 10-15min. And you can immediately enjoy your brand-new Korean-Japanese Hiragana - English keyboard when making contacts with your relatives, friends and acquaintances. What you're offered now is high-quality stickers, intended to simplify you work and enjoy it while doing it on computer. OUR MOTTO IS - QUALITY! The product listed above is copyrighted, has been manufactured and distributed by Royal Galaxy Ltd. Usage of the images posted, distribution or resale has NOT been authorized by Royal Galaxy Ltd, and is in direct violation of its written terms. Federal law provides severe civil and criminal penalties for the unauthorized usage, distribution or resale of copyrighted product, its listings with all imaged posted. For all requests regarding usage of images of this product, its distribution and resale, please contact us by email.",
        "average_rating": 3.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/512+T6c5lPL._AC_.jpg"
    },
    {
        "product_id": "B0BSNTW9ZS",
        "title": "2X SCROY Trackpoint Caps for Lenovo ThinkPad Replacement for Keyboard Mouse (Soft Rim)",
        "brand": "SCROY",
        "category": "Electronics",
        "price": 6.99,
        "description": "These trackpoints are replacements for Lenovo ThinkPad Soft Rim or Classic TrackPoint cap. The TrackPoint is compatible with ThinkPad laptops. This TrackPoint provides the best solution for you to replace the original TrackPoint when it is worn.",
        "average_rating": 2.7,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/31KmAgQgdBL._AC_.jpg"
    },
    {
        "product_id": "B01HME9RX2",
        "title": "65W 45W Charger Fit for Lenovo Yoga 710 310 510 520 530 720 330 C640 Laptop - (Safety Certified by UL)",
        "brand": "Dexpt",
        "category": "Electronics",
        "price": 14.99,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 1401,
        "image_url": "https://m.media-amazon.com/images/I/21JxXO+uRUL._AC_.jpg"
    },
    {
        "product_id": "B00A493CNY",
        "title": "StarTech.com DisplayPort to DVI Dual Link Active Adapter - DisplayPort to DVI-D Adapter Video Converter 2560x1600 60Hz - DP 1.2 to DVI Monitor - USB Powered - Latching DP Connector (DP2DVID2)",
        "brand": "StarTech",
        "category": "Electronics",
        "price": 91.07,
        "description": "This DisplayPort to DVI adapter lets you connect your DP device to any DVI display, including televisions and other DVI dual-link monitors. Ideal for Travel With its compact, lightweight design, this DVI adapter offers a convenient travel accessory to carry with your DP-equipped computer, fitting easily into your laptop bag or carrying case. Its ultra-portable design makes this display and monitor adapter perfect for BYOD (Bring Your Own Device) applications at the office, or on the road. As well, this DVI converter is powered by a USB port, eliminating the need for additional cords or chargers. Ultimate Compatibility With support for an active conversion, this DP to DVI-D adapter ensures compatibility with DVI dual-link monitors and displays, which eliminates having to upgrade your DVI display to a newer model for the sake of compatibility. Uncompromised Picture Quality This DVI D adapter can handle full dual-link resolutions up to 2560x1600 with the ability to mirror your display or extend your desktop. Alternatively, the converter can support single-link displays with resolutions up to 1920x1080. This DVI video adapter supports plug-and-play connectivity, ensuring a hassle-free setup. This DisplayPort to DVI adapter is backed by a StarTech.",
        "average_rating": 4.0,
        "total_reviews": 384,
        "image_url": "https://m.media-amazon.com/images/I/41ipnzwBz1L._AC_.jpg"
    },
    {
        "product_id": "B0BNV9DJVK",
        "title": "MP3 Player / MP4 Player, Hotechs MP3 Music Player with 32GB Memory SD Card Slim Classic Digital LCD 1.82'' Screen Mini USB Port with FM Radio, Voice Record",
        "brand": "Hotechs.",
        "category": "Electronics",
        "price": 23.99,
        "description": "Why Choose Hotechs. MP3-Player ♫ Long Battery Life & Fast Charge: Up to 10 hours of playback with 1-2 hours of full charge ♫ FM Radio: Built-in FM tuner, it supports Manual tune and Auto tune, receive the signal very easily ♫ Large Capacity: Built-in 32GB internal memory, the mp3 player supports up to 128GB Micro TF Card, which lets you add more storage ♫ Durable: Metal material case makes mp3 player more durable ♫ Create Folder: You can create folders in PC and put the songs into it ♫ Strong Compatibility:Windows 7/8/8.1/10/XP/Vista/2000/Mac OS 10 Specification ➳ Battery Capacity: 3.7 V / 200 mAh ➳ Screen: 1.8 inch TFT LCD screen ➳ Audio Format: Support MP3 ➳ Video Format: Support AMV with resolution of 240*320 ➳ Voice Recorder: Support MP3 / WAV ➳ Voice Recording Range: 5-8 meters ➳ Picture Browse: Support formats of JPEG/BMP (240*320) ➳ FM Receiving Frequency: 87.5 MHz~108 MHz ➳ E-Book: Support TXT format ➳ Size: 10.6 x 5 x 0.9 cm ➳ Net Weight: about 76 g ➳ Power Supply: DC 5V Micro USB interface ➳ Airframe Capacity: 16GB ➳ TF Card: maximum support 128GB (Memory SD HC Card is not included) Package 1 X MP3 Player 1 X User Manual 1 X USB Cable 1 X Earphone",
        "average_rating": 3.2,
        "total_reviews": 7,
        "image_url": "https://m.media-amazon.com/images/I/51YNXnFBewL._AC_.jpg"
    },
    {
        "product_id": "B0071SSBPK",
        "title": "Original MH-63 Battery Charger fits Nikon EN-EL10 Batteries (with Power Cord) for Ge camera",
        "brand": "GE",
        "category": "Electronics",
        "price": 19.99,
        "description": "Original MH-63 Battery Charger fits Nikon EN-EL10 Batteries (with Power Cord) for Ge camera . This Nikon MH-63 Original Battery Charger for EN-EL10 Li-Ion Batteries is for you to use to quickly and reliably charge the compatible batteries for your digital devices. Use this battery charger to easily charge your device's battery at home, in the office and keep your digital device for use.FEATURES: Compact and solid design and make with Original reliable quality Quickly and reliably charge your digital batteries With intelligent IC chip to prevent over-charging With Fold-out plugs on the back for easy storage As simple as plugging the unit in to the wall and inserting a battery, yet is small enough to take anywhere. SPECIFICATIONS: Original part#: Nikon MH-63Compatible battery models: Nikon EN-EL10 Li-Ion BatteriesInput: 100-240V, 50/60HzProduct Color: Black Dimension: (Approx.) 4 x 3 x 3 inches ; 4.8 ounces IMPORTANT NOTE: 1. This is a battery charger and you will need to take the battery out of the camera for charging.2. This charger is made of Nikon. And it is also compatible with Olympus LI-40B/LI-42B, Fujifilm NP-45, Pentax D-Li63, Kodak KLIC-7006, Casio NP-80 batteries.Compatible With Ge E1255W G3WP",
        "average_rating": 2.9,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/31DqX13uzZL._AC_.jpg"
    },
    {
        "product_id": "B07M67FJDB",
        "title": "CaseBot Leather Case for Kindle Oasis (10th and 9th Gen, 2019 and 2017 Release) - Slim Fit Protective Cover, Black",
        "brand": "CaseBot",
        "category": "Electronics",
        "price": 7.99,
        "description": "CaseBot, a premium series brought to you by Fintie! Protect your 7-Inch Kindle Oasis with this Fintie Slim Case at all times! The Slim Case sports a simple and classy design. The back shell is made from durable polycarbonate material so you do not need to worry about any damages. It offers an easy clip-on application. Our innovative cover was designed to specifically fit your Kindle Oasis and secures your device without any hinges or straps. Thin, lightweight, and durable, this cover is perfect for taking Kindle Oasis wherever you go. Available in a variety of bright and fun colors.",
        "average_rating": 4.5,
        "total_reviews": 1444,
        "image_url": "https://m.media-amazon.com/images/I/41TLloi1tdL._AC_.jpg"
    },
    {
        "product_id": "B0BKSXPZ82",
        "title": "Silicone Cover for NS-RCFNA-21 Insignia/Toshiba Firetv Remote, Silicone Protective Case for TV Omni Series and TV 4-Series 4K Remote with Lanyard(Red)",
        "brand": "AKSHFETH",
        "category": "Electronics",
        "price": 8.99,
        "description": "Compatible with：Toshiba and Insignia NSRCFNA21 CT-RC1US-21 CT95018 CTRC1US21 Remote. Please confirm the model of the remote control before placing an order!Made of soft, skin-friendly Silicone.Kids and Pets friendly Material.The back of the cover has a non-slip corrugated design,provide Great feel and grip.The soft and tough silicone material slides easily over the remote make it easy to install.Precise hole cuts fit the remote perfectly like a glove.",
        "average_rating": 4.2,
        "total_reviews": 25,
        "image_url": "https://m.media-amazon.com/images/I/51-xhzR2a4L._AC_.jpg"
    },
    {
        "product_id": "B07ZZ595TG",
        "title": "Aproca Hard Storage Travel Case, for AKASO EK7000 4K Sports Action Camera/Dremel Versa Cleaning Tool PC10",
        "brand": "Aproca",
        "category": "Electronics",
        "price": 14.99,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 489,
        "image_url": "https://m.media-amazon.com/images/I/5110krbdvtL._AC_.jpg"
    },
    {
        "product_id": "B09X52MNQY",
        "title": "Emergency Hand Crank Weather Solar Radio, radios Portable Power Bank 4000mAh Hand Crank AM FM/NOAA Radio with LED Flashlights Reading Lamp Cellphone Charger SOS Alarm for Camping Home Outdoor",
        "brand": "HOVOYNN",
        "category": "Electronics",
        "price": 22.98,
        "description": "",
        "average_rating": 4.2,
        "total_reviews": 19,
        "image_url": "https://m.media-amazon.com/images/I/51a5w2uJtkL._AC_.jpg"
    },
    {
        "product_id": "B0B2P1FPLF",
        "title": "Vbestlife Emergency Radio Battery Operated Transistor Radio AM/FM with Speaker Headphone Jack for Travel Camping Parents Gift(Silver Gray)",
        "brand": "Vbestlife",
        "category": "Electronics",
        "price": 9.89,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 8,
        "image_url": "https://m.media-amazon.com/images/I/41vWVDRvZAL._AC_.jpg"
    },
    {
        "product_id": "B01DLNTUYY",
        "title": "lcd4laptop HP TouchSmart 15-AC 15-AC121DX B156XTK01.0 15.6\" LCD Screen Display Touch",
        "brand": "lcd4laptop",
        "category": "Electronics",
        "price": 67.66,
        "description": "Extremely Important: You must match the resolution, backlight, and screen size to your current screen. You cannot deviate from your current screen specifications. Purchasing a screen with different specifications will not work with your system. If you are unsure what your current screen specification is, please contact us and we will gladly help. Also Note: You will receive a 100% compatible screen. The exact brand and part number of the screen you will receive is determined by market availability.",
        "average_rating": 4.4,
        "total_reviews": 74,
        "image_url": "https://m.media-amazon.com/images/I/41qtEPP6pQL._AC_.jpg"
    },
    {
        "product_id": "B08JYXM5XD",
        "title": "Airpods Case, Airpods Accessories Kits, 2 Pack Protective Silicone Cover Apple Airpods Anti-Lost Airbag Belt, for Apple AirPods 2nd 1st Generation (Black+White)",
        "brand": "meiyasy",
        "category": "Electronics",
        "price": 12.99,
        "description": "offers 100% Satisfaction Guarantee -180 days money back and lifetime technique support. Airpods Case, Airpods Accessories Kits, 11 in 1 Protective Silicone Cover and Skin for Apple Airpods with Anti-lost Airpods Strap, Airpods Watch band Holder, Airpods Ear Hook  Airpods Case is made from premium quality silicone material. Shock & Dust Resistant, Friendly to skin, Durable, Flexible, Portable and Lightweight. No need to worry about the apple airpods will loss! Perfects for gym, exercise, travel, hiking, cycling, running and any other outdoor activities even in rainy and snowy day. Package Shock Resistant & Dust Proof Silicone Airpods Case× 2 （Black+white） AirPods storage box× 1 （Black） Airpods Ear Hook× 2 （Black+white） Airpods Watch with Stand× 2 （Black+white） Airpods anti-drop belt× 2  （Black+white） Sturdy Keychain× 2    (Black) Product Description - Compatibility: The case is specially designed for Apple AirPods - Material: Made form high quality durable Silicone - Feature: Shock resistant and Dust proof - Smart Design: Access to lightning connector without removing the protective case when charging; Bulit in dust cap. - Portable: Keychain hole design and detachable carabiner - Lightweight: Only 1 Ounce  Our mission is to offer the superior quality products and provide the best customer service. - If you are not delighted with our product, please let us know by sending message or e-mail. We will get back to you faster than you can say. - We offer a 100% Satisfaction Guarantee! \"Add it to cart\"Now! NOTES: AirPods NOT included",
        "average_rating": 4.4,
        "total_reviews": 1411,
        "image_url": "https://m.media-amazon.com/images/I/41ZkNdV5DGS._AC_.jpg"
    },
    {
        "product_id": "B0993H9FLR",
        "title": "Alcatel Joy Tab 2 8 inch 2020 Kids Case(Model 9032Z), Alcatel Joy Tab 2 Case-SHREBORN Kids Shockproof Handle Friendly Case with Stand for Metroby t-Mobile Alcatel Joy Tab 2 8\" 2020 Tablet(Blue)",
        "brand": "SHREBORN",
        "category": "Electronics",
        "price": 14.9,
        "description": "Compatible Device: Designed by SHREBORN: kids Case for Metrobyt-Mobile Alcatel Joy Tab 2 8-inch Tablet 2020 Version (Model: 9032Z) Product advantages： 1.SHREBORN is the manufacturer. We use Amazon platform to better sell our products. You don't have to worry about after-sales service. We will provide one-year unsatisfactory return service.  2. SHREBORN designed to be inspired by animal Panda, it will be unique, and your child will love small animal shaped products to protect his Metrobyt-Mobile Alcatel Joy Tab 2 8-inch Tablet 2020(Model: 9032Z)   3.With the handle, your child can carry it with.Children can carry travel, change places , you don't have to worry about damaging your tablet, our products provide protection against collisions and falls.  4.You don't need to worry about the protective shell adding weight.Made from a lightweight, durable, kid-safe material Easy access to buttons, ports, and cameras. Features: -Exclusively designed to form-fit for the Metrobyt-Mobile Alcatel Joy Tab 2 8-inch Tablet 2020 (Model: 9032Z).  -Made entirely of durable EVA foam rubber.  -Soft, squishy material is fun and safe for children .  -Cutouts for clear access to all buttons, ports, speakers and rear-camera.  -Built-in, Foldable stand.  -Raised screen bezel for extra protection.  Note:  1. The tablet don't be included, NO screen protector included.  2. You are supposed to take out the black frame inside the case before you installing the tablet. Don't hesitate, what are you waiting for? It will be a perfect gift and your child will love it.",
        "average_rating": 4.7,
        "total_reviews": 2062,
        "image_url": "https://m.media-amazon.com/images/I/51g4ylPhjyS._AC_.jpg"
    },
    {
        "product_id": "B09QSNNBBV",
        "title": "erjigo Earphone, Customized Comfort, GK-GS10Earbuds, 4BA+1DD Configuration, Noise-canceling Headphone, HiFi Sports&Fitness Headphones (Black no mic)",
        "brand": "erjigo",
        "category": "Electronics",
        "price": 23.99,
        "description": "Product Details Brand:GKmodel:GS10Sensitivity:111dBPin Type:0.75mmImpedance:30ΩLine Length:125±5cmFrequency:7-40000HzEarphone weight:25±3gPlug Type:3.5mmconfiguration:30095 BA unitx2、50060 BA unitx2 10mm dual magnetic dynamicx1",
        "average_rating": 5.0,
        "total_reviews": 5,
        "image_url": "https://m.media-amazon.com/images/I/41WqjKsKZVL._AC_.jpg"
    },
    {
        "product_id": "B07T9GCD14",
        "title": "JBL CLIP 3 - Waterproof Portable Bluetooth Speaker - Gray (Renewed)",
        "brand": "Amazon Renewed",
        "category": "Electronics",
        "price": 43.97,
        "description": "Speakerphone",
        "average_rating": 4.7,
        "total_reviews": 1646,
        "image_url": "https://m.media-amazon.com/images/I/51AqjAfWf+L._AC_.jpg"
    },
    {
        "product_id": "B0B9JTJK7W",
        "title": "Valkit for New iPad Pro 12.9 2017 Cover, iPad Pro 12.9 Case, Apple iPad Pro 12.9 Inch 2015 Folio Smart Folio Stand Protective Heavy Duty Rugged Armor Cases with Apple Pencil Holder, Black",
        "brand": "valkit",
        "category": "Electronics",
        "price": 22.99,
        "description": "FIND YOUR IPAD MODEL *** ON THE BACK OF YOUR IPAD COMPATIBLE ONLY WITH: Both work with iPad Pro 12.9 inch 2017 Edition [ A1670 / A1671 ] and iPad Pro 12.9 inch 2015 [ A1584 / A1652 ] Edition (not included Apple pencil and iPad device). **NOT work for iPad Pro 12.9 Inch 2018 /2020 or other iPad models. FEATERES: 【 Auto Wake/Sleep 】 Magnetic auto sleep/wake feature works seamlessly and smoothly to help extend your iPad’ s battery life. 【 Stable Tri-fold Stand 】 Tri-fold front cover with dual standing positions for enjoy the most comfortable keyboard-typing and movie-viewing 【 Apple Pencil Holder 】 Using your Apple Pencil whenever you want and never get lost easily to carry your Apple pencil with your device.  【 Removable Front Cover 】 Easy to install and remove with soft flexible case, never leaves scratches on your iPad. 【 Precise Cutouts 】 Allowing users to have full access to all features of the iPad (buttons, speakers, cameras) 【 Perfect Display 】 The translucent frosted back cover shows the original look and charm of your iPad, while protects your device against fingerprints and scratches. Package Includes: 1 x Apple iPad Pro 12.9 Case 2017/2015 Available in a variety of bright and fun colors.",
        "average_rating": 4.6,
        "total_reviews": 2642,
        "image_url": "https://m.media-amazon.com/images/I/511XTIr08xL._AC_.jpg"
    },
    {
        "product_id": "B00JYFN9YG",
        "title": "ICE 100mm ND1000 Square Filter Neutral Density 10 Stop Optical Glass fits Cokin Z",
        "brand": "ICE",
        "category": "Electronics",
        "price": 49.95,
        "description": "ND1000 Filter. 10 Stop exposure correction. No color cast. Optical Glass. Compare to Lee Big Stopper. Fits Cokin Z-100, Lee & Hitech 100mm drop in Filter holders.",
        "average_rating": 4.3,
        "total_reviews": 72,
        "image_url": "https://m.media-amazon.com/images/I/21ZUBBtdr4L._AC_.jpg"
    },
    {
        "product_id": "B0C559BCG4",
        "title": "Arlo Camera Housing - Arlo Certified Accessory - Change Your Camera Housing to Fit Your Space, Works with Arlo Pro 5S 2K, Pro 4, Pro 3, Ultra 2, and Ultra Cameras, White - VMA5202H",
        "brand": "Arlo",
        "category": "Electronics",
        "price": 37.64,
        "description": "Quickly and easily change the housings on your Arlo cameras to get the look that fits your space. Compatible with Pro 5S 2K, Pro 4, Pro 3, Ultra 2, and Ultra Cameras.",
        "average_rating": 4.6,
        "total_reviews": 50,
        "image_url": "https://m.media-amazon.com/images/I/31Q+VVg-3eL._AC_.jpg"
    },
    {
        "product_id": "B01AC7CC24",
        "title": "Compatible with Chevy Tahoe 1995 1996 1997 1998 1999 2000 2001 2002 Single DIN Stereo Harness Radio Install Dash Kit Package",
        "brand": "Harmony Audio",
        "category": "Electronics",
        "price": 24.99,
        "description": "This Package Includes the Following Items: 1 x Metra 99-3002 GM Installation Kit for Select 1995-2005 Cadillac / GMC / Chevrolet Full-Size Vehicles 1 x Metra 99-3002 GM Installation Kit for Select 1995-2005 Cadillac / GMC / Chevrolet Full-Size Vehicles 1 x Buick Cadillac Chevy GMC Factory Stereo Radio to Aftermarket Radio Harness Adapter 1 x Buick Cadillac Chevy GMC Factory Stereo Radio to Aftermarket Radio Harness Adapter 1 x Buick Chevy Cadillac GMC Oldsmobile Pontiac Factory Radio to Aftermarket Antenna Adapter 1 x Buick Chevy Cadillac GMC Oldsmobile Pontiac Factory Radio to Aftermarket Antenna Adapter Metra 99-3002 GM Installation Kit for Select 1995-2005 Cadillac / GMC / Chevrolet Full-Size Vehicles: Quick conversion from DIN to 2-Shaft with snap-in style shaft supports Quick conversion from DIN to 2-Shaft with snap-in style shaft supports Recessed DIN Opening Recessed DIN Opening Designed for ISO Mount radio with ISO Trim ring Designed for ISO Mount radio with ISO Trim ring High-grade ABS Plastic High-grade ABS Plastic Buick Cadillac Chevy GMC Factory Stereo Radio to Aftermarket Radio Harness Adapter: Specifications : Simply plug and play installation, no cutting required Simply plug and play installation, no cutting required Designed for standard audio system, premium audio may require different harness Designed for standard audio system, premium audio may require different harness Clearly marked color coded wires Clearly marked color coded wires Ideal for any aftermarket radio Ideal for any aftermarket radio 18 gauge high quality wire 18 gauge high quality wire Direct OEM fit connection Direct OEM fit connection Buick Chevy Cadillac GMC Oldsmobile Pontiac Factory Radio to Aftermarket Antenna Adapter: Specifications : Simply plug and play installation, no cutting required Simply plug and play installation, no cutting required Adapts factory antenna plug into aftermarket style Adapts factory antenna plug into aftermarket style Ideal for any aftermarket radio Ideal for any aftermarket radio Direct OEM fit connection Direct OEM fit connection",
        "average_rating": 4.7,
        "total_reviews": 40,
        "image_url": "https://m.media-amazon.com/images/I/41Nv9jaM0YL._AC_.jpg"
    },
    {
        "product_id": "B0B7JQWK1Q",
        "title": "iPhone Charger Cord, | Apple MFi Certified | Lightning Cable 3 Pack USB Fast Charging Cord Compatible with Apple iPhone 13 12 11 Pro Max XR XS X/8Plus/7Plus/6Plus/5s/iPad iPod Touch More (10FT, Grey)",
        "brand": "byojia",
        "category": "Electronics",
        "price": 9.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 56,
        "image_url": "https://m.media-amazon.com/images/I/41qNCcBu6FL.jpg"
    },
    {
        "product_id": "B07XYHC577",
        "title": "Grain Valley DriveTrack 71 Protective Cover Heavy Duty Silicone (Hunter Orange)",
        "brand": "Grain Valley",
        "category": "Electronics",
        "price": 17.5,
        "description": "The GS71 is a custom-designed cover for the Drive Track 71.",
        "average_rating": 3.8,
        "total_reviews": 21,
        "image_url": "https://m.media-amazon.com/images/I/310nBg0njWL._AC_.jpg"
    },
    {
        "product_id": "B0C3C5S2H3",
        "title": "VEKOOTO RV Backup Camera System Wired AHD 1080P 7“ Split Screen Monitor, IP69 Recording/Waterproof/Night Vision, 2 Channels Camera for Truck Camper Adapter Trailer (N72)",
        "brand": "VEKOOTO",
        "category": "Electronics",
        "price": 98.32,
        "description": "",
        "average_rating": 4.1,
        "total_reviews": 32,
        "image_url": "https://m.media-amazon.com/images/I/517nSocSsZL._AC_.jpg"
    },
    {
        "product_id": "B07C9W6G2Y",
        "title": "A-Tech 1GB STICK For Dell Vostro Desktop Series 200 Mini Tower 200 Slim Tower 200S (Slim Tower) 220 Mini Tower 220s Slim Tower 320 (All-In-One) 400 400 Mi. DIMM DDR2 NON-ECC PC2-6400 800MHz RAM Memory",
        "brand": "A-Tech",
        "category": "Electronics",
        "price": 11.97,
        "description": "",
        "average_rating": 5.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/41aXS2qFopL._AC_.jpg"
    },
    {
        "product_id": "B0BX49PM8V",
        "title": "Rockville KRYPTON-M0 1400w Peak/350w RMS Mono 1 Ohm Car Amplifier Amp+Remote",
        "brand": "Rockville",
        "category": "Electronics",
        "price": 89.95,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 17,
        "image_url": "https://m.media-amazon.com/images/I/41Rls1f+JUS.jpg"
    },
    {
        "product_id": "B099RB31ML",
        "title": "POHNUI 3 Pack Leather Bands Compatible with Fitbit Versa 2/Versa/Versa Lite/Versa SE for Women Men, Adjustable Soft Leather Replacement Strap Wristband for Fitbit Versa Smart Watch",
        "brand": "POHNUI",
        "category": "Electronics",
        "price": 16.95,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 320,
        "image_url": "https://m.media-amazon.com/images/I/513wBdYg-TL._AC_.jpg"
    },
    {
        "product_id": "B09TS8MB1T",
        "title": "Supveco iPad Air 5th/4th Generation Case 2022/2020, iPad 10.9 Inch Cover with Pencil Holder, [Support 2nd Apple Pencil Charging+Touch ID] Trifold Stand Case with Soft TPU Back, Rose Gold",
        "brand": "Supveco",
        "category": "Electronics",
        "price": 16.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 264,
        "image_url": "https://m.media-amazon.com/images/I/51NF2aufjEL._AC_.jpg"
    },
    {
        "product_id": "B007JT4AW4",
        "title": "Olympus SZ30 SZ10 SZ11 SZ12 SZ14 SZ20 SZ30 SZ-10 SZ-11 SZ-12 SZ-14 SZ-20 ~ LCD Screen Display ~ DIGITAL CAMERA Repair Parts Replacement",
        "brand": "Olympus",
        "category": "Electronics",
        "price": 25.99,
        "description": "This item does not include screwdriver or adhesive. If you want the screwdriver, you need to buy this item: http://www.amazon.com/gp/product/B005BOYGL4",
        "average_rating": 3.4,
        "total_reviews": 4,
        "image_url": "https://m.media-amazon.com/images/I/31eBdrr+92L._AC_.jpg"
    },
    {
        "product_id": "B07XHT7GM4",
        "title": "BLLQ Ear Hooks Compatible with Air Pods [Anti-Drop][Comfortable] [Fit] [Durable], Compatible with AirPod1 & 2 Earbud Ear Hook ，White",
        "brand": "BLLQ",
        "category": "Electronics",
        "price": 5.99,
        "description": "Features These BLLQ Anti-Slip Ear Hooks hold your Air Pods securely and prevents it from falling out. Great for running, jogging, cycling, gym and other fitness activities! Fit &Comfortable Ear Hooks are made from High Quality Hybrid Thermoplastic polyurethane(TPU) to ensure that they keep their shape perfectly fit for your ear and Air Pods, they are very useful to prevent earbuds falling out and very comfortable for use. Easy Installation Easy installation & hassle-free removal. Put the Air Pods on the Earhooks and it loops over the ear. Durable These Ear Hooks don’t fit in charge case, Please take if off before put into the charge case. But Don’t Worry: These High Quality Ear Hooks is very durable that they can be frequently put on and removed and would not be break or out of shape. Package includes: BLLQ Anti-Slip Ear Hooks 1 Pair (Left & Right 2 PCS), Blue cleaning cloth with BLLQ LOGO 1PCS,(Hooks Only ,Earphones not included).",
        "average_rating": 3.6,
        "total_reviews": 190,
        "image_url": "https://m.media-amazon.com/images/I/31PlPE-p-LL._AC_.jpg"
    },
    {
        "product_id": "B0B6P5NF2Z",
        "title": "Galaxy Tab S8+/ S7 FE/ S7+ Keyboard Case 12.4 inch Keyboard Case for Samsung Tab S8 Plus/S7 FE/S7 Plus - Backlit Wireless Detachable Keyboard with S Pen Holder, Slim Multi-Angle, Black",
        "brand": "YEHOBU",
        "category": "Electronics",
        "price": 35.98,
        "description": "",
        "average_rating": 3.7,
        "total_reviews": 30,
        "image_url": "https://m.media-amazon.com/images/I/51pT4kRlRhL._AC_.jpg"
    },
    {
        "product_id": "B07FZ21VWY",
        "title": "Dteck Case for iPad Mini 1/2/3/4 - Slim Premium Leather Multi-Angle View Stand Folio Smart with Auto Wake/Sleep Soft Back Cover for Apple iPad Mini 5th Gen 2019/Mini 4/Mini 3/Mini 2, Pink Sand",
        "brand": "Dteck",
        "category": "Electronics",
        "price": 12.99,
        "description": "Compatibility: Designed especially for the Apple iPad mini 5 / iPad mini 4 / iPad mini 3 / iPad mini 2 / iPad mini 1, please check your iPad model carefully before purchasing! Multi-angle Viewing Stand: Built-in two grooves provide sturdy standing viewing angle, and magnet folding front cover allows you to use it in a horizontal stand, convenient for viewing and typing. Precision cutouts: Precise cutouts design makes all ports, buttons, cameras and microphones be accessible easily without removing the case. Auto Sleep/ Wake: Built-in magnet to control sleep/wake function, close or open the case will let your iPad go into sleep/wake mode automatically, so no more worries about scratches on the iPad screen or waking up your ipad. Q1: Does it fit original iPad mini? Answer: Absolutely, because this item specially design for the Apple iPad Mini / Mini 2 / Mini 3 / Mini 4 / Mini 5 (7.9 inch) tablet. Q2: Does it come in a sleep and wake option? Answer: Yes, it does. Q3: Does this case burn the battery ? Answer: No, it support auto wake/ sleep function. Save the battery perfectly. Q4: Does the case include magnetic closure ? Answer: Yes, it does. Q5: What will I get in the package if I place the order? Answer: You will get, 1 x iPad Mini Case, 1 x Random Color Stylus Pen and 1 x Clean Cloth as gift from Dteck.",
        "average_rating": 4.4,
        "total_reviews": 269,
        "image_url": "https://m.media-amazon.com/images/I/41VddRdv1xL._AC_.jpg"
    },
    {
        "product_id": "B0BJL1MZ16",
        "title": "YUNLOVXEE Mini Cell Phone Fan for iPhone - 4 Pack Personal Portable Pocket Small Fan for Travel Outdoor Commuting, Cell Phone Fan Plug in iPhone, iPad Pro Air Max Plus Mini Cellphone Accessories",
        "brand": "YUNLOVXEE",
        "category": "Electronics",
        "price": 9.99,
        "description": "",
        "average_rating": 4.3,
        "total_reviews": 13,
        "image_url": "https://m.media-amazon.com/images/I/31vIZ7StMXL._AC_.jpg"
    },
    {
        "product_id": "B08LF36XD2",
        "title": "Youkamoo 4 Pin XLR Balanced Male Compatible for Hifiman HE4XX, HE-400i Headphones 8 Core Braided Silver Plated Replacement Audio Upgrade Cable (2 x 3.5mm Version)",
        "brand": "Youkamoo",
        "category": "Electronics",
        "price": 23.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 140,
        "image_url": "https://m.media-amazon.com/images/I/41abb4XicxL.jpg"
    },
    {
        "product_id": "B08225X6DB",
        "title": "MightySkins Carbon Fiber Skin for Apple Airpods Pro - Abstract Black | Textured Carbon Fiber Finish | Easy to Apply, Remove, and Change Styles | Made in The USA",
        "brand": "MIGHTY SKINS",
        "category": "Electronics",
        "price": 9.82,
        "description": "introducing textured carbon fiber skins with Printed HD designs only from mightyskins we are proud to introduce the new textured carbon fiber skin line which feature a full HD printed design with a textured carbon fiber finish. Do you want your Apple AirPods Pro to look Different Than The rest? you’re in the right place because we've got exactly what you’re looking for! This Abstract Black skin is the perfect way to show off your style! Or with hundreds of other MightySkins designs, you can be sure to find one that you’ll love, and that will show off your unique style! do you want to protect your Apple AirPods Pro? with MightySkins your Apple AirPods Pro is protected from scratches, dings, dust, fingertips, and the wear-and-tear of everyday use! Cover your Apple AirPods Pro with a beautiful, stylish decal skin and keep it protected at the same time! easy to apply, and easy to remove without any sticky residue! make your favorite gear look like new, and stand out from the crowd! order with Confidence - Satisfaction Guaranteed! MightySkins are durable, reliable, made in our state-of-the-art production facility in the U.S.A., and backed by our satisfaction guarantee! • vinyl decal stickers> • not a HARD case • Matte finish  • Ultra-thin, ultra-durable, Stain Resistant  • hundreds of different designs • Apple AirPods Pro is not included.",
        "average_rating": 3.4,
        "total_reviews": 16,
        "image_url": "https://m.media-amazon.com/images/I/51jk3HY3LvL._AC_.jpg"
    },
    {
        "product_id": "B07GJV8JQ4",
        "title": "F3 Cycling Bike Stem Computer Mount Holder Stand - Anti-Shake, Adjustable, Fits GPS (Garmin, Wahoo, Sigma, Hammerhead), Cameras and Lights",
        "brand": "FormMount",
        "category": "Electronics",
        "price": 60.55,
        "description": "The marvel of FormMount’s direct stem integration is the ability to fit virtually any 4 bolt stem in multiple mounting positions. Carbon filled polymeric materials provide stiffness, strength and light weight. Overmolded CNC stainless steel inserts provide a secure stem connection. Transforms into a phone mount with add on component. Camera and light integration with add on component. Accenting colors available in orange, yellow, white, red, green blue and gray. COMPATIBILITY: Supports Garmin, Wahoo and Sigma Sport. Other leading brands in development. INCLUDES: Garmin and Wahoo inserts. 2 lengths sizes stainless steel M5 bolts and custom black anodized aluminum spacers. WEIGHT: 24.89G",
        "average_rating": 3.9,
        "total_reviews": 89,
        "image_url": "https://m.media-amazon.com/images/I/414D5oJkIBL._AC_.jpg"
    },
    {
        "product_id": "B004TNKXBU",
        "title": "AC Power Cord Cable 6FT for NEC Computer Monitor with Life Time Warranty",
        "brand": "Extenuating Threads",
        "category": "Electronics",
        "price": 9.89,
        "description": "AC Power Cord Cable 6FT for Samsung LCD TV and many more electronic device using the same plug type.",
        "average_rating": 5.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/51TVtkw-ZRL.jpg"
    },
    {
        "product_id": "B0BX6GGSTJ",
        "title": "APBFH Keyboard Brush Kit for Cleaning Computer Laptop PC Car Detailing(Set of 3)",
        "brand": "APBFH",
        "category": "Electronics",
        "price": 12.99,
        "description": "",
        "average_rating": 4.7,
        "total_reviews": 26,
        "image_url": "https://m.media-amazon.com/images/I/416kPEQ1xYL._AC_.jpg"
    },
    {
        "product_id": "B01N4IEZ67",
        "title": "LZCT 4K HDMI 2.0 Cable 100FT Unidirectional High-Speed HDMI Cord V2.0 with Built-in Signal Booster Support 3D UHD 2160P HDR 1080P with Ethernet and ARC(Length from 3' to 125') Dual Color Mould",
        "brand": "LZCT",
        "category": "Electronics",
        "price": 53.99,
        "description": "LZCT HIGH SPEED HDMI CABLE - 4K HDMI 2.0 READY - ETHERNET & AUDIO RETURN CHANNEL 100FT Cable is Directional Input end needs to be connected to input devices such as the cable box, PS3, X-Box, DVD / Blu-Ray Player etc. Output end needs to be connected to display devices such as HDTV, Projector etc. Introduction - Compatible with all HDMI Devices. Works with all HDMI Versions. - Easier to Install. The best Connection for all Brands. -Compatibility: Blu-ray, DVD Player, XBOX 360, PS3, HDTV, LED/LCD TV, Plasma TV, Home Theater, HD Cable, HD Satellite, DVRs, computers and more. - Large gauge PVC jacket and braid mesh provides maximum shielding against wear, tear and extreme temperatures. - Guaranteed 4Kx2K (4,096x2,160 pixels), 1440p, 1080p, 1080i, 720p, 480p, and 480i Resolutions. Compatibility - Supports 3D Content. - Supports Audio Return Channel. - Supports Highest Refresh Rates up to 240hz and 48-Bit Deep Color. - Supports Transfer Rates of Up to 340Mhz or 10.2gbps. - Supports True HD Dolby 7.1 and DTS-HD Master Audio. - HDCP Compliant. Return Policy - Item can be returned or replaced if needed. - We try every best to make each customer happy with fast service.",
        "average_rating": 4.6,
        "total_reviews": 1163,
        "image_url": "https://m.media-amazon.com/images/I/31INkmataTS._AC_.jpg"
    },
    {
        "product_id": "B07PCMZVTF",
        "title": "1 Pair of Round Protein Leather Ear Pads Cushion Cover Earpads Compatible with SMS Audio Street by 50 Over-Ear Wired Headphones (White)",
        "brand": "YDYBZB",
        "category": "Electronics",
        "price": 6.99,
        "description": "",
        "average_rating": 4.4,
        "total_reviews": 30,
        "image_url": "https://m.media-amazon.com/images/I/41mLYPapjdL._AC_.jpg"
    },
    {
        "product_id": "B078GKFJ9M",
        "title": "SLLEA AC/DC Adapter for LG Flatron W2286L W2286LV W2286L-PF 22 Widescreen LCD Monitor Power Supply Cord Wall Home Charger PSU",
        "brand": "SLLEA",
        "category": "Electronics",
        "price": 18.89,
        "description": "SLLEA AC / DC Adapter For LG Flatron W2286L W2286LV W2286L-PF 22 Widescreen LCD Monitor Power Supply Cord Wall Home Charger PSU",
        "average_rating": 3.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/51lBsfZHpKL._AC_.jpg"
    },
    {
        "product_id": "B00XIT6C20",
        "title": "Metra TYTO-01 JBL Amplifier Interface Harness & Metra 70-8114 Steering Wheel Control Wire Harness with RCA for 2003-Up Select Toyota/Scion/Lexus Vehicles",
        "brand": "AXXESS",
        "category": "Electronics",
        "price": 80.89,
        "description": "Metra TYTO-01 JBL Amplifier Interface HarnessWiring Harness for Select 2003-2008 Toyota Vehicles with JBL/JBL Synthesis Audio SystemsMetra 70-8114 Steering Wheel Control Wire Harness with RCA for 2003-Up Select Toyota/Scion/Lexus VehiclesSteering Wheel Control Wire Harness with RCA for 2003-Up Select Toyota/Scion/Lexus Vehicles",
        "average_rating": 4.3,
        "total_reviews": 1368,
        "image_url": "https://m.media-amazon.com/images/I/31vXNrCk1hL._AC_.jpg"
    },
    {
        "product_id": "B08S7RR9JJ",
        "title": "EKWB EK-Classic GPU Water Block RTX 3080/3090, Digital RGB, Nickel/Plexi",
        "brand": "EKWB",
        "category": "Electronics",
        "price": 170.89,
        "description": "EK-Classic GPU Water Block RTX 3080/3090 D-RGB is compatible with most reference design (not Founders Edition) GeForce RTX 3080 and 3090 graphics cards. These newly developed water blocks feature optimized flow paths that reduce hydrodynamic instabilities and vortexing (dead spots) inside of them. Additionally, this new design allows the terminal to be screwed directly onto the copper cold plate of the GPU block, making it more rigid and reducing the chances of damaging the water block. This water block is purpose-designed with a much thicker 11.2 mm copper base to clear the tall capacitors on most reference design graphics cards. This gives the water block advantage on the market of having a clean design and a wider compatibility list, without sacrificing any coolant flow restriction. The block features additional cutouts on the base to accommodate non-standard fan-headers and additional PCB components that certain reference designs have. The EK-Classic water block directly cools the GPU, VRAM, and the VRM as cooling liquid is channeled right over these critical areas. The water block is in contact with MOSFETs and chokes to maximize cooling and minimize the chances of coil whine, unlike some products that are currently available on the market. The base of the block is CNC machined out of nickel-plated electrolytic copper while the top is CNC machined out of high-quality acrylic material. The sealing is ensured by quality rubber O-rings. Screw-in brass standoffs are pre-installed and allow for a safe, painless installation procedure. This product is compatible with popular RGB sync technologies from all major motherboard manufacturers. The arrow marking on the 3-pin LED connector is to be aligned with the +5V marking on the D-RGB (A-RGB) header. Technical specifications: - D-RGB cable length: 30cm- D-RGB connector classic 3-pin (+5V, Data, Empty, Ground) Model: 3831109833445",
        "average_rating": 4.2,
        "total_reviews": 6,
        "image_url": "https://m.media-amazon.com/images/I/41HlPGNqgqL.jpg"
    },
    {
        "product_id": "B08JZ5CFWZ",
        "title": "Laptop Bag for Women Waterproof Lightweight 15.6 Inch Leather Laptop Tote Bag Large Women Briefcase Professional Business Office Computer Work Bags Shoulder Handbag Brown",
        "brand": "Lubardy",
        "category": "Electronics",
        "price": 25.99,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 1239,
        "image_url": "https://m.media-amazon.com/images/I/51lwPuOz+7L._AC_.jpg"
    },
    {
        "product_id": "B000HHHP7C",
        "title": "KByte Fingerprint Security Reader",
        "brand": "K-Byte",
        "category": "Electronics",
        "price": 54.08,
        "description": "Login and Password Replacement for: Windows logon, Websites, Applications such as VPN clients, File and folder encryption, Fast user switching, Workstation lock and unlock",
        "average_rating": 4.0,
        "total_reviews": 327,
        "image_url": "https://m.media-amazon.com/images/I/41Y2XTNAiWL._AC_.jpg"
    },
    {
        "product_id": "B07TB2C8QS",
        "title": "Apevia Aura-P-BK Mid Tower Gaming Case with 2 x Full-Size Tempered Glass Panel, Top USB3.0/USB2.0/Audio Ports, 4 x RGB Fans, Black Frame",
        "brand": "Apevia",
        "category": "Electronics",
        "price": 75.99,
        "description": "",
        "average_rating": 4.3,
        "total_reviews": 1119,
        "image_url": "https://m.media-amazon.com/images/I/41fuytEOuBL._AC_.jpg"
    },
    {
        "product_id": "B07Q1JN792",
        "title": "C&E High Speed HDMI Cable with Ethernet Black, (6 Feet/1.8 Meters), Supports 4K, 3D and Audio Return",
        "brand": "C&E",
        "category": "Electronics",
        "price": 8.99,
        "description": "Overview: The HDMI cable is the newest and best digital video connection on the market. HDMI is the only cable that can transfer uncompressed high-definition video and multi channel digital audio in resolutions higher than 1080p. HDMI cables are convenient because they will allow the transfer of digital audio and video in a single cable, permitting a less confusing mess of wires and a cleaner entertainment center. They are backward compatible to all previous versions. Main Features: • 1080p Resolution. Audio Return Channel 3D - 3D is the latest rage for both home theater and gaming. • 4K - The 4K resolution is 3840 x 2160 pixels @ 24 Hz. • Deep Color - The Deep Color feature provides a minimum of 8-bits per color element (24-bits total), providing for a total of over 16 million color variations. x.v.Color - x.v.Color High Definition Audio - HDMI supports a full range of high definition audio types, including SA-CD, DVD-Audio, DTS-HD Master Audio, and Dolby TrueHD. Specifications: • Our High Speed HDMI cables - with Ethernet have been designed to meet the performance standards. They are backward compatible to all previous versions. • HDMI Ethernet Channel - The HDMI cable adds a data channel to the HDMI connection, enabling high-speed, bi-directional communication. Connected devices that include this feature can send and receive data via 100 Mb/sec Ethernet, making them instantly ready for any IP-based application. • Audio Return Channel - The new specification adds an audio channel that will reduce the number of cables required to deliver audio \"\"upstream\"\" from a TV to an A/V receiver for processing and playback. In cases where a TV features an internal content source, such as a built-in tuner or DVD player, the Audio Return Channel allows the TV to send audio data upstream to the A/V receiver via the HDMI cable, eliminating the need for an extra cable. • 3D Support - The version of the specification defines common 3D formats and resolutions for HDMI-enabled devices, enabling 3D gaming and other 3D video applications. • 4K Resolution Support - The new specification enables HDMI devices to support extremely high HD resolutions, effectively four times the resolution of a 1080p device. Support for 4K allows the HDMI interface to transmit digital content at the same resolution as the state-of-the-art Digital Cinema systems used in many movie theaters. Cables & Etc is the owner of the trademark C&E. This UPC is trademarked under C&E. Any violation will be reported to Amazon without any prior warning.",
        "average_rating": 4.6,
        "total_reviews": 531,
        "image_url": "https://m.media-amazon.com/images/I/41IfnleVoML._AC_.jpg"
    },
    {
        "product_id": "B08QCPDKW1",
        "title": "waveshare Jetson Nano Developer Kit Small Computer for AI Development - B01 New Version",
        "brand": "waveshare",
        "category": "Electronics",
        "price": 206.99,
        "description": "",
        "average_rating": 3.6,
        "total_reviews": 13,
        "image_url": "https://m.media-amazon.com/images/I/414NgToO2+L._AC_.jpg"
    },
    {
        "product_id": "B07XFQGPCG",
        "title": "Rockford Fosgate R2-200X2 Prime 200-Watt 2-Channel Amplifier",
        "brand": "Rockford Fosgate",
        "category": "Electronics",
        "price": 219.99,
        "description": "",
        "average_rating": 4.7,
        "total_reviews": 62,
        "image_url": "https://m.media-amazon.com/images/I/31wm1e2f66L._AC_.jpg"
    },
    {
        "product_id": "B07VLDQMV3",
        "title": "Active USB 2.0 Printer Cable 50Ft - A-Male to B-Male High Speed Printer/Scanner/Repeater Cable for HP, Canon, Lexmark, Dell, Samsung etc (50Ft/15M)",
        "brand": "Tan QY",
        "category": "Electronics",
        "price": 19.99,
        "description": "\"After redecorating the office, you found that you could no longer reach the printer with your new computer stand. Or you just need a replacement when the printing job is getting worse using your original USB cable.USB 2.0 printer scanner cable works perfectly for your printer and laptop/ desktop. Well-Constructed and Hi-Speed: Not only does this bus-powered extended length USB 2.0 cable make it possible for you to use your printer reliably, but also it is well constructed with foil & braid shielding reduces EMI/RFI interference and twisted-pair construction reduces crosstalk thus ensuring high speed up to 480 Mbps error-free data transfer. Gold-plated copper contacts provide maximum conductivity and minimize data loss. Specific: Connector 1: USB 2.0 Type A - Male Connector 2: USB 2.0 Type B - Male Full USB 2.0 capability, backward compatible with 1.1/ 1.0 Max. Transfer Rate: 480 Mbps Shield: foil & braided shielding Material: 100% Bare Copper Conductors; Silver-plated Contacts; PVC Jacket; Copper Braid and Aluminum- Mylar Foil Color: Translucent Black Packing Included: 1 x USB 2.0 AM to BM Cable",
        "average_rating": 4.5,
        "total_reviews": 188,
        "image_url": "https://m.media-amazon.com/images/I/41jdWMkKIkL.jpg"
    },
    {
        "product_id": "B07H8QWTPH",
        "title": "Apple 16GB iPad Air Wi-Fi Silver MGLW2LL/A (Renewed)",
        "brand": "Amazon Renewed",
        "category": "Electronics",
        "price": 140.0,
        "description": "Product Highlights  -9.7\" IPS LCD Multi-Touch Retina Display -2048 x 1536 Native Resolution -Tri-Core Apple A8X CPU with M8 Chip -0.96 lb and 0.24\" Thick -802.11a/b/g/n/ac Wi-Fi, Bluetooth 4.0 -Touch ID Fingerprint Sensor -Front 1.2-Megapixel FaceTime HD Camera -Rear 8-Megapixel 1080p iSight Camera -Lightning Connector, AirPlay, AirDrop -Gyro, Accelerator, Ambient Light Sensor",
        "average_rating": 4.1,
        "total_reviews": 712,
        "image_url": "https://m.media-amazon.com/images/I/41bvGz7T10L._AC_.jpg"
    },
    {
        "product_id": "B08HCXS2L5",
        "title": "LOVEVOOK Laptop Backpack Purse for Women, Work Business Travel Computer Bags, Teacher Nurse Backpack for Womens, Quilted Casual College Daypack with USB Port, Fit 15.6 Inch Laptop, Grey",
        "brand": "LOVEVOOK",
        "category": "Electronics",
        "price": 39.98,
        "description": "",
        "average_rating": 4.8,
        "total_reviews": 6656,
        "image_url": "https://m.media-amazon.com/images/I/41BXzLXQBiL._AC_.jpg"
    },
    {
        "product_id": "B0045ZMWPM",
        "title": "Amamax F-Pin Coupler, Female / Female. F Type Connectors,10 pack",
        "brand": "Amamax",
        "category": "Electronics",
        "price": 6.99,
        "description": "",
        "average_rating": 4.3,
        "total_reviews": 7,
        "image_url": "https://m.media-amazon.com/images/I/41sny4mpQ+L._AC_.jpg"
    },
    {
        "product_id": "B07MKWC2XN",
        "title": "ASHATA 13.9inch HD TV Portable DVD Player with Eye-Protected Swivel Screen 800 * 480 Resolution 16:9 LCD Screen,Support TV/Game/FM Radio Function.(Black)",
        "brand": "ASHATA",
        "category": "Electronics",
        "price": 89.03,
        "description": "Description: This DVD player is a high definition and high-quality broadcast equipment. It is a multi-functional combination of DVD player, TV player, FM radio receiver, memory card reading, playing games, and so on. Equipped with rechargeable lithium battery for long working, fully suitable for home, office, vehicle and other occasions.   Features:  1.USB interface: Can be plugged into hard disk drive or U disk. 2.Super electronic seismic circuit. (DVD3 seconds, CD / VCD10 seconds, MP3 90 seconds). 3.Built-in 3D audio processing. Support FM radio function. 4.Intelligent power off memory function.   Specifications: Plug type: UK Color: Black Video: D / A Converter 10bit Horizontal resolution: 500line Frequency characteristics: 20Hz-20kHz Dynamic range 80db Audio signal to noise ratio 70db Channel isolation 70db Dynamic range: 96kHz / 24bit Audio signal to signal to noise ratio: 2VP - P Pixel image resolution: 234x480 RGB Signal System: PAL / SECAM / Automotive / For New York Shipbuilding Company Power supply: 100-240 50hz 50Hz Power: 15w Receive channel: lhf1-5 vhf6-12 uhf13-69 ATV Resolution: 800 * 480 LCD size: 10.1 inch (Diagonal) Overall size: 13.9 inch (Diagonal) Battery capacity: 800mah Package weight: Approx. 1450g  Package List: 1 x DVD Player 1 x Power Adapter  1 x Remote Control 1 x AV Cable  1 x Radio Antenna  1 x CD  1 x Game Handle  1 x User Manual  1 x Car Charger",
        "average_rating": 3.3,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/51E0CYqVX7L._AC_.jpg"
    },
    {
        "product_id": "B003Y2PK92",
        "title": "Fotodiox Replacement Rear Lens Cap Compatible with Sony Alpha A-Mount and Minolta AF DSLR Cameras",
        "brand": "Fotodiox",
        "category": "Electronics",
        "price": 8.25,
        "description": "Fotodiox Rear Lens Cap for Sony Alpha, Minolta AF lenses. Fits Sony A100, A200, A230, A290, A300, A330, A350, A380, A390, A450, A500, A550, A560, A580, A700, A850, A900, SLT-A35, A33, A37, A55, A57, A65, A77, Minolta 5D, 7D, 7, 9xi, 7xi, 5xi",
        "average_rating": 4.2,
        "total_reviews": 65,
        "image_url": "https://m.media-amazon.com/images/I/41taqIE60-L._AC_.jpg"
    },
    {
        "product_id": "B077BNJHVJ",
        "title": "ASUS UX430UN-NB71 ZenBook 14\" Ultra-Slim Laptop with 14 inch FHD Display, Intel Core i7-8550U (up to 4.00 GHz)",
        "brand": "ASUS",
        "category": "Electronics",
        "price": 999.99,
        "description": "ASUS ZenBook 14 UX430UN-NB71 Ultra-Slim Laptop with 14 inch FHD Display, Intel Core i7-8550U (up to 4.00 GHz), 8 GB LPDDR3, 256 GB SSD, NVIDIA GeForce MX150, Windows 10, Backlit keyboard. 14-Inch wide-view Full-HD Nano-edge bezel display in 13\" chassis with Windows 10. Latest 8th generation Intel Quad-Core i7-8550U Processor (8M Cache, up to 4.00 GHz). Fast storage and memory featuring 256 GB SSD with 8 GB LPDDR3 RAM. Extensive connectivity with micro HDMI / USB Type C, 802.11ac Wi-Fi, SD Card Reader and Backlit keyboard. Sleek and lightweight 2.87 lbs. aluminum body for comfortable portability. Built-in fingerprint reader with one-touch login via Windows Hello feature. Bundled laptop sleeve, Micro HDMI to HDMI and USB 3.0 to LAN dongles.",
        "average_rating": 4.2,
        "total_reviews": 59,
        "image_url": "https://m.media-amazon.com/images/I/41tPciYs5jL._AC_.jpg"
    },
    {
        "product_id": "B0000XMWT4",
        "title": "Orion 8728 32mm Sirius Plossl Telescope Eyepiece",
        "brand": "Orion",
        "category": "Electronics",
        "price": 38.39,
        "description": "From the Manufacturer This 32mm Plossl 1.25\" eyepiece is ideal for all types of telescopes: reflector, refractor, and Cassegrain. Offers a 52 Degree apparent field of view for clear, sharp images of the Moon, planets and many deep space objects with impressively high contrast. Eyepiece optics are multi-coated for bright, clear views. Offers a very wide true field and a wide apparent field for dramatic visual effects. Threaded for use with 1.25\" telescope eyepiece filters",
        "average_rating": 4.5,
        "total_reviews": 49,
        "image_url": "https://m.media-amazon.com/images/I/31JqAI+nLnL._AC_.jpg"
    },
    {
        "product_id": "B08X2DCF2B",
        "title": "Verbatim 4.7GB Up to 16X Datalifeplus White Inkjet Printable Recordable Disc DVD-R, 50 -Disc Spindle",
        "brand": "Verbatim",
        "category": "Electronics",
        "price": 26.94,
        "description": "Combining an exceptional inkjet hub-printable surface with professional grade, Metal Azo, recording performance and reliability, Verbatim DataLifePlus White Inkjet Hub Printable DVD-R 8x discs are the ultimate choice for developing, customizing and distributing DVD content. Certified for 1x-8x* DVD recording and preferred by DVD-R drive manufacturers, Verbatim DataLifePlus DVD-R media uses an advanced “Metal Azo” recording dye to provide the highest level of performance, compatibility, and archival life. DataLifePlus White Inkjet Hub Printable 8x DVD-R discs have been extensively tested and qualified for use with DVD/CD Inkjet printers and duplicators offered by such leading industry manufacturers as Primera, Microboards & Epson.",
        "average_rating": 4.6,
        "total_reviews": 1104,
        "image_url": "https://m.media-amazon.com/images/I/41max0L5CSL._AC_.jpg"
    },
    {
        "product_id": "B08LPNPFC4",
        "title": "Kate 10x15ft/3m(W) x4.5m(H) Large Black Backdrop Dark Texture Backgrounds Seamless Portrait Photography Backdrops Photography Studio Prop",
        "brand": "Kate",
        "category": "Electronics",
        "price": 162.0,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 84,
        "image_url": "https://m.media-amazon.com/images/I/41eXgNWDniL._AC_.jpg"
    },
    {
        "product_id": "B071YJFTV4",
        "title": "Laptop Sleeve Elastic Neoprene Case Compatible with 13-14 inch MacBook Air/Pro M1 M2, XPS 13, Surface Laptop 13.5\", Water Repellent Notebooks Hand Bag with Handle and Small Case,Butterfly",
        "brand": "Hseok",
        "category": "Electronics",
        "price": 15.99,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 8298,
        "image_url": "https://m.media-amazon.com/images/I/51wJ5C7w1+S._AC_.jpg"
    },
    {
        "product_id": "B0B8CY1MJ4",
        "title": "SIMOLIO Wireless Headphones for TV Watching with Transmitter/Charging Dock 2 in 1, 2.4G Wireless Earbuds for TV Listening, Dialog Mode & Boosted Vol & Spare Battery for Seniors, by-Pass, 100ft Range",
        "brand": "SIMOLIO",
        "category": "Electronics",
        "price": 79.99,
        "description": "",
        "average_rating": 4.0,
        "total_reviews": 54,
        "image_url": "https://m.media-amazon.com/images/I/41XZsM-uDQL._AC_.jpg"
    },
    {
        "product_id": "B0B6S3PLNR",
        "title": "Wirenest 12ft VISCA PTZ Daisy Chain Camera Control Cable for Sony EVI/BRC/SRG Series RS232 8 Pin Mini DIN to 8 Pin Mini DIN Serial",
        "brand": "Wirenest",
        "category": "Electronics",
        "price": 24.5,
        "description": "VISCA Daisy Chain Control Cable Brand New! Remotely control PAN / TILT / ZOOM / FOCUS / IRIS of VISCA Cameras",
        "average_rating": 4.6,
        "total_reviews": 252,
        "image_url": "https://m.media-amazon.com/images/I/31dUK3gjPWS.jpg"
    },
    {
        "product_id": "B00CY8S41S",
        "title": "Senal Coiled Replacement Coiled Cable for SMH-1000 Headphones - 4 to 10' (1.2-3 m)",
        "brand": "Senal",
        "category": "Electronics",
        "price": 21.06,
        "description": "The coiled Coiled Replacement Coiled Cable for SMH-1000 Headphones - 4 to 10' (1.2 - 3 m) from Senal provides mobility, reach and helps prevent snags from pulling the headphones off of your head. The detachable, twist-locking coiled cable stretches from 4 to 10' (1.2 - 3 m), and terminates to a 1/8\" stereo mini connector, but also has a screw-lock to attach your 1/4\" adapter, not included. Cable Length: 4 to 10' (1.2 - 3 m) Connector: 1/8\" (3.5 mm) TRS stereo",
        "average_rating": 4.0,
        "total_reviews": 7,
        "image_url": "https://m.media-amazon.com/images/I/51qqfwbOHxL._AC_.jpg"
    },
    {
        "product_id": "B001E6BAHQ",
        "title": "Softalk 301ST MiniSoftalk ShoulderRest Black",
        "brand": "Softalk",
        "category": "Electronics",
        "price": 14.94,
        "description": "- Softalk mini shoulder rest- 4.5 inches in length- Attaches to handset with adhesive- Black",
        "average_rating": 3.0,
        "total_reviews": 20,
        "image_url": "https://m.media-amazon.com/images/I/31vnf4SPovL._AC_.jpg"
    },
    {
        "product_id": "B071JDPKJ8",
        "title": "AUDIOPIPE SPEAKER 3.5\" 2-WAY (pair) 90 WATTS",
        "brand": "Audiopipe",
        "category": "Electronics",
        "price": 22.95,
        "description": "Wattage: 90W. Dimension: x x L.. Weight: 1.7 lbs.. 30mm Mylar Tweeter. 3.5 Injection Cone With Rubber Edge. Oz. Magnet Weight. 0.75 ASV Coil. Ohm Impedance. 90 Max. Power.",
        "average_rating": 4.0,
        "total_reviews": 29,
        "image_url": "https://m.media-amazon.com/images/I/51pZPESMRdL._AC_.jpg"
    },
    {
        "product_id": "B07X46T141",
        "title": "DHK Leather Backpack Vintage Laptop Bookbag for Women Men Travel Rucksack Bag",
        "brand": "DHK",
        "category": "Electronics",
        "price": 69.99,
        "description": "This vegan leather backpack is stylish and classic looking. It is suitable for college carrying laptop, books and other necessaries for classes. Also good size fashion backpack for going to work, campus, gym, recreation, weekend getaways, travel and casual daily use.",
        "average_rating": 4.0,
        "total_reviews": 42,
        "image_url": "https://m.media-amazon.com/images/I/41dU47-3Y9L._AC_.jpg"
    },
    {
        "product_id": "B0BG5NKDL7",
        "title": "Safe Sound Personal Alarm for Women, 130dB Loud Personal Safety Alarm Keychain with Strobe Led Light, Personal Security Alarm Safety Keychain Help Women Men Elderly Kids in Emergency",
        "brand": "Pawcute",
        "category": "Electronics",
        "price": 14.89,
        "description": "",
        "average_rating": 4.3,
        "total_reviews": 47,
        "image_url": "https://m.media-amazon.com/images/I/41sm-QGhlHL._AC_.jpg"
    },
    {
        "product_id": "B07PS6M97W",
        "title": "TENINYU 3.5mm Mono Cable - 12V Trigger, IR Infrared Sensor Receiver Extension Extender, 3.5mm 1/8\" TS Monaural Mini Mono Audio Plug Jack Connector Male to Male Cable (3FT)",
        "brand": "TENINYU",
        "category": "Electronics",
        "price": 6.49,
        "description": "3.5mm Mono 1/8\" Male to Male TS Audio Cable This cable is designed to interconnect electronic devices with 3.5mm mono phone jacks. It is ideal for use as a 12V trigger cable.  Specifically intended to provide quality signal transfer for mono audio and data transfer applications. It features two 24 AWG oxygen-free copper conductors, a drain wire, an aluminum foil shield to prevent unwanted EMI/RFI interference, and fully molded, nickel-plated connectors providing strain relief for a quality connection. Unlike other Cables Affordable Mono cables offers a High-performance versatile cable accurately transfer quality detailed clean natural pure audio sound with realism and clarity jitter-free mono format signals; Balanced solid conductors for enhanced internal noise rejection and clearer, deeper bass and eliminate strand-interaction distortion  These mono to mono jack leads can also be used to link Hi-fi units, such as Pioneer, in order so they can stay controlled via a single remote control.  Ideal for Wide Variety of Applications Affordable premium 1/8” Mono cables TS IR Infrared Sensor Receiver Extension cables are ideal for DVD Bluray Player Car Audio System, DAC, CD, Game Console AV Receiver, Digital Recorder, Headphone, Computer sound card, audiophile quality home theater cinema HiFi system and more.  Connect components that utilize a 3.5mm serial data jack such as whole house automation systems or mono audio devices such as telephone systems.  ​Compatible with most A/V components, power amps, pre-amps, projectors, electronic screens, and IR infrared receivers & senders. Package Content:  1x 3.5mm Mono Cable 3FT- 12V Trigger, IR Infrared Sensor Receiver Extension Extender, 3.5mm 1/8\" TS Monaural Mini Mono Audio Plug Jack Connector Male to Male Cable",
        "average_rating": 4.7,
        "total_reviews": 231,
        "image_url": "https://m.media-amazon.com/images/I/41qsMG3SlNL.jpg"
    },
    {
        "product_id": "B007VJTUQ8",
        "title": "QVS 15-Foot Blue USB 3.0 Type A Male to Type B Male Cable (CC2219C-15)",
        "brand": "QVS",
        "category": "Electronics",
        "price": 10.49,
        "description": "Connect your computer to USB 3.0 peripherals. With this USB SuperSpeed cable you can connect to hubs and peripherals such as printers, scanners, and storage drives.",
        "average_rating": 1.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/41ihY-Vv+PL._AC_.jpg"
    },
    {
        "product_id": "B0915C35CH",
        "title": "KBEAR KS2 in Ear Monitors,H HIFIHEAR 1BA 1DD Stereo in Ear Earphones, HiFi in Ear Ear Earbud Headset Noise Cancelling Hybrid Earphone with Removable Cable for Running Walking (with mic, KS2 Cyan) …",
        "brand": "H HIFIHEAR",
        "category": "Electronics",
        "price": 25.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 461,
        "image_url": "https://m.media-amazon.com/images/I/41tQ3l5v5sL._AC_.jpg"
    },
    {
        "product_id": "B07WWX18K5",
        "title": "in-Ear Monitors,　KZ ZSX 1DD+5BA Hybrid HiFi Stereo Noise Isolating Sport IEM Earphones/Earbuds/Headphones with Detachable Cable, Computer (Without MIC, Black)",
        "brand": "erjigo",
        "category": "Electronics",
        "price": 64.99,
        "description": "SPECIFICATIONS Brand: KZ Model: ZSX Driver: 1DD+5BA Connectivity: Wired Earphone type: In-Ear Interface: 3.5mm plug Pin type : 0.75mm 2PIN Sensitivity: 111dB/mW Impedance: 24Ω Frequency range: 7Hz-40kHz Cable Length: 125±4cm Product Weight: 31g Color Options: Purple/ Black/Cyan Detachable cable: Yes Microphone: Optional Package Included: 1x Pair of KZ-ZSX Earphones  3 x Pairs of Earbud tips(S/M/L)  1 x 2pin Detachable cable 1x User Manual&Warranty Card 【1 year warranty】: You will get 1 year warranty and friendly customer service from the date of purchase. Please feel free to contact us if any problems, we are very happy to provide help for you. Thanks~",
        "average_rating": 4.5,
        "total_reviews": 118,
        "image_url": "https://m.media-amazon.com/images/I/41IJiZr6sbL._AC_.jpg"
    },
    {
        "product_id": "B08RJDB78J",
        "title": "SKTU for 2020 2021 2022 2023 Toyota Tacoma Screen Protector 8 Inch 2020 2021 2022 2023 Toyota Tacoma N300 GPS Display Tacoma Third Generation Tempered Glass Tacoma 2023 Accessories 9H Hardness Anti Scratch HD Clear Toyota Tacoma 2022 2023 Screen Protector LCD Screen Protective Film for 2023 Toyota Tacoma SR5/TRD Sport/TRD Off-Road/Limited/TRD Pro (8In with 8 buttons)",
        "brand": "SKTU",
        "category": "Electronics",
        "price": 13.95,
        "description": "2020 2021 2022 2023 Tacoma Screen Protector Tacoma 2023 Accessories 2023 Tacoma SR5/TRD Sport/TRD Off-Road/Limited/TRD Pro Screen Protector 8 Inch Which kind of Protector should you choose? If you wanna the protector for your 2020 2021 2022 2023 Tacoma N300 navigation, The Tempered Glass protector is your first choice: 1. 9H Hardness will protect your 2022 2023 Tacoma N300 screen from scratch, shatter, Provide comprehensive protection 2. Oleophobic Coating will repel oil left from your fingerprints, easy to wipe and keep your 2020 2021 2022 2023 Tacoma Third Generation screen brand new 3. 0.26mm Thickness ensures a better smooth touching feeling, at the same time, restore the color of the 2020 2021 2022 2023 Tacoma screen 4. 2.5D Arc Edge reduce the probability of broken screen 5. Automatic Absorption make the installation easier, just need soft finger touch to complete it Why do you choose SKTU 2020 2021 2022 2023 Tacoma Screen Protector? 1.We strictly control every production link, From choose material to make the Tacoma glass protector, No errors are allowed. 2.We have our own R&D personnel to collect the most accurate data. 3.We use the premium quality of glass and the glue to ensure the 2020 2021 2022 2023 Tacoma N300 protector's quality 4.We always put first the customer's satisfaction, try our best to solve customer's any problem. Package Included 1 X Navigation Screen Protector 1 X Installation Auxiliary Tools(Plastic Sucker*1,Dry Wipe*1,Wet Wipe*1,Micro-Fiber Cloth*1) Tips: Make sure your 2020 2021 2022 2023 Tacoma 8 Inch screen is original, not assembled  Before installation, pls align the Tacoma screen first Pls contact the seller,if you are not satisfied with the product, It is better to add the described problem and pictures, we will give you the best resolution in 24 hours",
        "average_rating": 4.0,
        "total_reviews": 148,
        "image_url": "https://m.media-amazon.com/images/I/5174GuaTIrL._AC_.jpg"
    },
    {
        "product_id": "B0BDQMXQFY",
        "title": "Gimbal Tripod Head for Camera,YELANGU Professional Heavy Metal 360 Panoramic Shooting Gimbal stabilizer for DSLR Camera with 1/4\" 3/8\" Quick Release Plate and Bubble Level, Up to 33lbs/15kg",
        "brand": "YELANGU",
        "category": "Electronics",
        "price": 75.98,
        "description": "",
        "average_rating": 4.2,
        "total_reviews": 45,
        "image_url": "https://m.media-amazon.com/images/I/31+wsUBTuwL._AC_.jpg"
    },
    {
        "product_id": "B00KO8RLZ0",
        "title": "20 4GB Flash Drive - Bulk Pack - USB 2.0 Swivel Design in BLACK",
        "brand": "SameDayFlash",
        "category": "Electronics",
        "price": 95.0,
        "description": "These USB 2.0 flash drives are built with high quality material and backed by a lifetime warranty. The metallic 360° cap makes it perfect for logo printing and customization for your business, projects, events or any of your marketing needs.These drives are affordable, lightweight, compact and can fit on a lanyard or key chain. It's 360° rotation cap which provides a sleek and durable layer of protection to the pen drive and its data from drops and physical contact. With USB 2.0 speeds you can quickly transfer music, video, files and more or distribute information with ease.",
        "average_rating": 5.0,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/516lx5iwo5L._AC_.jpg"
    },
    {
        "product_id": "B0BVLBJNF3",
        "title": "Blue Aesthetic Stickers,150pcs, Funny Cute Stickers for Teens, Girls, Adults Stickers Suitable for Water Bottles, Laptop, Phone, Hydro Flask Vinyl Waterproof Aesthetic Sticker Pack",
        "brand": "KEANBOLL",
        "category": "Electronics",
        "price": 8.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 364,
        "image_url": "https://m.media-amazon.com/images/I/61o3EKM8atL._AC_.jpg"
    },
    {
        "product_id": "B01B7ZNKZ8",
        "title": "E-Kylin Car Auto Waterproof License Plate Mount Rear View Backup Camera Wide Angle with IR LED Night Vision Look Up and Down Adjustable",
        "brand": "EKYLIN",
        "category": "Electronics",
        "price": 20.99,
        "description": "NTSC Car Slim License Plate Mount Backup Camera Easy Installation: 1. Mount the camera to your car's license plate area, back window, or any other suitable place 2. Adjust the lens of the camera to its best position. 3. Connect power wire (red and black) to your vehicle DC 12V power system. 4. Connect the video output (yellow wire) of the camera to the display in your vehicle. Specification: - Image device: CCD HD 7070 - TV system: NTSC - Effective pixels: 628 X 586 pixels - Resolution: 420 TV lines - Power supply: DC 12V Package Included: - 1 x Car Rear View Camera - 1 x DC power cable(1.2M) - 1 x AV cable with Red Trigger Wire(6M)",
        "average_rating": 3.5,
        "total_reviews": 8,
        "image_url": "https://m.media-amazon.com/images/I/31+XVGBh9qL._AC_.jpg"
    },
    {
        "product_id": "B00P1Q17ZU",
        "title": "Samsung HL-S6186W TV Assembly Cage with Projector bulb",
        "brand": "SAMSUNG",
        "category": "Electronics",
        "price": 31.99,
        "description": "Replacement lamp for Samsung HLS6186W projector with high quality compatible bulb. The replacement lamp include:  - generic housing compatible with Samsung HLS6186W projector - high quality compatible Projector Bulb The compatible bulb is made by the bulb manufacturer to meet the specifications and requirements for the Samsung HLS6186W projector and to performs similar to the OEM bulb version. Offering high quality at an affordable price, these compatible bulbs are ideal substitutes for high priced factory original bulbs. Warranty The Samsung HLS6186W projector replacement lamps are completely covered under our 90-day warranty, which protects against any defective products.  We are committed to offering an easy and safe Projector Bulb buying experience that brings peace of mind to all our customers.  Warranty does not cover: shipping costs, improper installation including damages incurred while attempting installation, any installation or labor costs, lamps damaged by TV/projector malfunction, damage due to abuse, lightning or acts of nature, misuse, electrical stress or power surges, loss of use, lost profits.",
        "average_rating": 3.7,
        "total_reviews": 15,
        "image_url": "https://m.media-amazon.com/images/I/51WOUlwuI0L._AC_.jpg"
    },
    {
        "product_id": "B016XL20UM",
        "title": "ICOLOR Lovely Kitty 9.7 10 Inch Laptop Carrying Bag Neoprene eBook Bag Travel Briefcase Portable Notebook Tablet Sleeve Case with Handle Fits 10 Inch Dell Google Acer HP Lenovo Asus (IHB10-18)",
        "brand": "icolor",
        "category": "Electronics",
        "price": 10.88,
        "description": "iColor 10 inch Laptop Carrying Bag Sleeve,Made of 4.5mm Soft Neoprene Fabric,Protect Your Laptop from Scratching, Shock and Dust Same Print on Front and Back,Double Zipper Design Glides Smoothly and Allows Convenient Access to Your Laptop Computer Slim and Lightweight,Waterproof,Super Soft Handle,Easy to Carry Mashine Washable,Can be Repeated Cleaning, Easy to Dry. Never Fade Dimension: about 28cm(11\") x 23cm(9\") X2cm; Compatible with: Most 9.7,10.1 tablet",
        "average_rating": 4.7,
        "total_reviews": 322,
        "image_url": "https://m.media-amazon.com/images/I/41yZ09L5fyS._AC_.jpg"
    },
    {
        "product_id": "B07LBPWW3D",
        "title": "SUPLIK Kids Case for iPad 5th/6th Generation (9.7-inch, 2017/2018), iPad Air 2 Case with Screen Protector, iPad Pro 9.7 Durable Shockproof Protective Cover with Handle Stand for Kids, Black",
        "brand": "Suplik",
        "category": "Electronics",
        "price": 15.98,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 12854,
        "image_url": "https://m.media-amazon.com/images/I/51+59i44HWL._AC_.jpg"
    },
    {
        "product_id": "B004NXQNU6",
        "title": "Intel Xeon Processor W3690 (12M Cache, 3.46 GHz, 6.40 GT/s Intel QPI)",
        "brand": "Intel",
        "category": "Electronics",
        "price": 148.68,
        "description": "Intel Xeon Processor W3690, 3.46 GHz, 12MB Cache, LGA1366, 32nm process technology",
        "average_rating": 5.0,
        "total_reviews": 5,
        "image_url": "https://m.media-amazon.com/images/I/41dKDKJPjZL._AC_.jpg"
    },
    {
        "product_id": "B09YLH6RVV",
        "title": "Lonlonty M12 8 Pin Male & Female Socket Panel Aviation Wire Connector,12mm Industrial Circular Connector, Outdoor Waterproof IP67,4 Sets",
        "brand": "Lonlonty",
        "category": "Electronics",
        "price": 52.99,
        "description": "",
        "average_rating": 4.3,
        "total_reviews": 21,
        "image_url": "https://m.media-amazon.com/images/I/51ytfDkhhOL._AC_.jpg"
    },
    {
        "product_id": "B07CRQDTKM",
        "title": "ProCase 14-15.6 Inch Laptop Bag Messenger Shoulder Bag Briefcase Sleeve Case for MacBook Pro 16\" / Surface Book 3 15\", 14 15 15.6 Inch Laptop Ultrabook Notebook MacBook Chromebook Computer –Grey",
        "brand": "ProCase",
        "category": "Electronics",
        "price": 25.99,
        "description": "",
        "average_rating": 4.6,
        "total_reviews": 1015,
        "image_url": "https://m.media-amazon.com/images/I/510HCN8zHbL._AC_.jpg"
    },
    {
        "product_id": "B07GTX1VM7",
        "title": "Walway Universal Mini Tripod Stand Mount with Holder Clip Adapter for Gopro, Smartphones, Compact Cameras DSLRs",
        "brand": "Walway",
        "category": "Electronics",
        "price": 6.99,
        "description": "★★Full 1 Year Walway Tech Warranty All Walway Tech products are built with high quality standards and we provide Full 1 Year Warranty and 30 Days Money Back; Walway Tech products have been well tested before shipping to you, but we cannot guarantee the parcel on the way to you, please understand us and please feel free to contact us via Amazon Message System anytime you need help, we provide Lifetime Technical Support for you and promise will do our best to help you solve any problems. ★★Product Parameter Panorama rotation: 360 ° Front and rear pitch: -35°/+ 35° Interface (top): 1/4 screws Material: ABS Plastic Max. Load: 0.5kg Minimum Height: 5.31in/ 13.5cm Folding Length: 7.48in/ 19cm Net Weight: 3.88oz/ 110g Gross Weight: 5.29 oz/ 150g Package Size: 8.46*2.36*1.77in/ 21.5*6*4.5cm ★★Product Features 1). Standard 1/4\" Screw Perfect for most devices, such as Gopro HERO Cameras, Nikon Canon Sony, DSRLs and so on. 2). 360 Degree Rotation Adjustable 360 degree rotating, perfect choice for capturing the best shooting angle. 3). Light weight and Portable With 5.31inch(not included the clip length) of working height, 7.48 inch(not included the clip length) of folding length and 3.88oz of weight, portable and lightweight for travelling, easy to carry with. 4). Come with a Holder Clip With the holder clip, you can attach your phone to the tripod easily (fit phone wide from 2.17\" to 3.37\"). 5). Humanized Design Just toggle the lock button when you have already adjusted the shooting angle, and it will keep steady, The anti-slip pad design help protect your device from slipping. ★★Package Included -1x Mini Tripod -1 x Holder Clip Adapter",
        "average_rating": 2.9,
        "total_reviews": 14,
        "image_url": "https://m.media-amazon.com/images/I/31wjUtOWLQL._AC_.jpg"
    },
    {
        "product_id": "B01CTOZYBE",
        "title": "RivenAn Camera Clamp Tripod Bike Bicycle Motorcycle Handlebar Handle Bar Camera Mount + Tripod Adapter for Digital Cameras Gopro Hero 4 3+ 3 2 1",
        "brand": "RivenAn",
        "category": "Electronics",
        "price": 7.99,
        "description": "Features: The quick release handle bar mount may be used with any GoPro camera and most digital cameras on the market. Non-GoPro cameras are also compatible as long as they have a 1/4\" tripod screw port (The most commonly used crew size on the market). The adjustable arm allows users to adjust the mount at any desired angle and the adjustable clamp further secures the arm at any desired position. The adjustable screw top allows the GoPro to rotate 360 degrees and can be easily tightened to prevent unwanted movement. Within the clamps of the Handlebar Mount are rubber grips, which provide a sturdy and non-slip hold. The clamp opens to 4cms and can clamp on to widths as small at 1.5cms. Comes with Tripod/Monopod mounting adapter for attaching your quick-release GoPro camera to a standard tripod.  Specification: Compatibility: For GoPro Hero 1 2 3 3+ 4 or cameras with a 1/4\" threaded screw mount Fit: For bar with diameters of between 1.5cm and 4cm Material: PC + Stainless steel Color: Black  Package includes: 1 * Handle Bar Mount 1 * Adapter",
        "average_rating": 3.6,
        "total_reviews": 20,
        "image_url": "https://m.media-amazon.com/images/I/410gGluRlsL._AC_.jpg"
    },
    {
        "product_id": "B0BP7FT28L",
        "title": "Replacement Remote for Toshiba and Insignia Fire TV Edition (No Voice Search)",
        "brand": "AZMKIMI",
        "category": "Electronics",
        "price": 11.99,
        "description": "",
        "average_rating": 3.9,
        "total_reviews": 174,
        "image_url": "https://m.media-amazon.com/images/I/31YjwCXakYL._AC_.jpg"
    },
    {
        "product_id": "B0BZY82YDR",
        "title": "CableCreation 4K HDMI Cable 3ft Down Angle 90 Degree Right Angle, Support 4K@60Hz Ultra HD 3D Video, Male to Male Black HDMI Cable for TV, PC, Gaming and More",
        "brand": "CableCreation",
        "category": "Electronics",
        "price": 9.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 196,
        "image_url": "https://m.media-amazon.com/images/I/31Y7rYRfxaL.jpg"
    },
    {
        "product_id": "B07WVHLQTK",
        "title": "GMYLE AirPod Case Accessories Set, Protective Silicone Cover Skin with Keychain, Magnetic Strap Kit for Airpods Wireless Charging Bluetooth Earbuds Case, Compatible with Apple AirPods 1 & 2, Black",
        "brand": "GMYLE",
        "category": "Electronics",
        "price": 9.98,
        "description": "",
        "average_rating": 4.2,
        "total_reviews": 560,
        "image_url": "https://m.media-amazon.com/images/I/411HOqQ2rBL._AC_.jpg"
    },
    {
        "product_id": "B0BL2GDGHK",
        "title": "Beauty and The Beast Stickers 61PCS Vinyl Waterproof Stickers for Laptop Bumper Skateboard Water Bottles Computer Phone Cartoon Anime Stickers for Kids Teens Adult",
        "brand": "CUIHJ",
        "category": "Electronics",
        "price": 8.99,
        "description": "",
        "average_rating": 3.6,
        "total_reviews": 27,
        "image_url": "https://m.media-amazon.com/images/I/61sGY6mM0nL._AC_.jpg"
    },
    {
        "product_id": "B000G14VL2",
        "title": "Promise Technology SATA300 TX4302 2PORT Esata Ext & Int",
        "brand": "Promise Technology",
        "category": "Electronics",
        "price": 39.99,
        "description": "1. Supports up to four Serial ATA 3G devices total 2 external Serial ATA (eSATA) 3Gb/s Ports 2 internal Serial ATA 3Gb/s Ports2. eSATA connectors provide hot-plug capabilities and better performance than USB or 1394 solutions 3. Supports up to 2TB of storage per controller (500GB HDD x 4-ports) 4. Supports Native Command Queuing (NCQ) 5. Supports Tagged Command Queuing (TCQ) 6. Large LBA support for drives above 137GB 7. 66MHz PCI host bus interface for up to 266MB/s bandwidth8. Supports Serial ATAPI devices9. Onboard Disk Activity LED Headers10. Dual controller support within a system 11. Simple solution for users who require internal or external 3Gb/s SATA storage space and ideal for desktops and workstations using SATA drives",
        "average_rating": 3.9,
        "total_reviews": 5,
        "image_url": "https://m.media-amazon.com/images/I/31hkdY+xpYL._AC_.jpg"
    },
    {
        "product_id": "B0949F55S3",
        "title": "Compatible with Penguin AirPods Case Pro, Kids Teens Girls Boys Women Protective Silicone Skin for Penguin AirPod Case, Funny Kawaii Fashion Cartoon 3D Cute Cover for AirPods Pro Penguin（Penguin）",
        "brand": "Moydolo",
        "category": "Electronics",
        "price": 9.99,
        "description": "",
        "average_rating": 4.4,
        "total_reviews": 259,
        "image_url": "https://m.media-amazon.com/images/I/31EZiDMLLeS._AC_.jpg"
    },
    {
        "product_id": "B0B852M28H",
        "title": "DETUOSI Universal 10.1 inch Tablet Case, 10 inch Tablet Cover, Travel Portable Protective Folio Leather Stand Shell Case【with 4 Fixed Rings】for All Kinds of 9.6-10.5 inch Android/iOS/Windows Tablet #3",
        "brand": "DETUOSI",
        "category": "Electronics",
        "price": 19.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 2771,
        "image_url": "https://m.media-amazon.com/images/I/614QcF2IdFS._AC_.jpg"
    },
    {
        "product_id": "B000I7VWKC",
        "title": "Dayton Audio SAT-BK 3-3/4\" 2-Way Satellite Speaker Pair Black",
        "brand": "Dayton Audio",
        "category": "Electronics",
        "price": 74.99,
        "description": "Dayton Audio’s compact multi-purpose speakers are designed to provide excellent clarity and detail for use in any surround sound or general audio application. These speakers are capable of much bigger sound than their small size suggests.",
        "average_rating": 4.6,
        "total_reviews": 89,
        "image_url": "https://m.media-amazon.com/images/I/51WhJwEpLhL._AC_.jpg"
    },
    {
        "product_id": "B07VP4PJ16",
        "title": "Lenovo Legion Y540 15.6\" FHD Gaming Laptop Computer, 9th Gen Intel Hexa-Core i7-9750H Up to 4.5GHz, 16GB DDR4 RAM, 1TB HDD + 512GB PCIE SSD, GeForce GTX 1650 4GB, 802.11ac WiFi, Windows 10 Home",
        "brand": "Lenovo",
        "category": "uncategorized",
        "price": 1235.0,
        "description": "2019 Lenovo Legion Y540 15.6\" FHD Gaming Laptop Computer, 9th Gen Intel Hexa-Core i7-9750H Up to 4.5GHz, 16GB DDR4 RAM, 1TB HDD + 512GB PCIE SSD, GeForce GTX 1650 4GB, 802.11ac WiFi, Windows 10 Home",
        "average_rating": 4.1,
        "total_reviews": 58,
        "image_url": "https://m.media-amazon.com/images/I/51skE6plVqL._AC_.jpg"
    },
    {
        "product_id": "B0B3SMDK54",
        "title": "VIVO Spare RF Remote for Compatible Electric Motorized TV Mounts, 2 Memory Settings, Radio Frequency, Wide Operating Range, Batteries Not Included, Black, PT-RT-70",
        "brand": "VIVO",
        "category": "Electronics",
        "price": 14.99,
        "description": "Spare RF remote control (PT-RT-70) from VIVO. Fits our electric TV mounts; MOUNT-E-FD55, MOUNT-E-FD70, MOUNT-E-MM070, MOUNT-E-UP44, MOUNT-E-UP65, and MOUNT-E-WM075.",
        "average_rating": 4.2,
        "total_reviews": 13,
        "image_url": "https://m.media-amazon.com/images/I/31u9kkyCCNL._AC_.jpg"
    },
    {
        "product_id": "B071VQ9Y8W",
        "title": "Turntable Belt for Dual 522 Turntable",
        "brand": "Vintage Electronics",
        "category": "uncategorized",
        "price": 17.75,
        "description": "This is the drive belt for the Dual 522 turntable. These are brand new stock belts made to the OEM specs. All belt kits come with a Lifetime Warranty",
        "average_rating": 5.0,
        "total_reviews": 3,
        "image_url": "https://m.media-amazon.com/images/I/31WXiClheyL._AC_.jpg"
    },
    {
        "product_id": "B00XISYQ06",
        "title": "Garmin NMEA 2000 Terminator (Male)",
        "brand": "Garmin",
        "category": "Electronics",
        "price": 14.99,
        "description": "We make products that are engineered on the inside for life on the outside. We do this, so our customers can make the most of the time they spend pursuing their passions.",
        "average_rating": 4.6,
        "total_reviews": 54,
        "image_url": "https://m.media-amazon.com/images/I/31GHi5s5pdL._AC_.jpg"
    },
    {
        "product_id": "B098NX26X2",
        "title": "VIIVY VIYIV Metal Case Compatible with Apple AirTag for Women Girls, Hollow-Out Protective Cover Keychain Holder for Air Tag Finder - Black",
        "brand": "VIIVY VIYIV",
        "category": "Electronics",
        "price": 12.99,
        "description": "",
        "average_rating": 4.4,
        "total_reviews": 174,
        "image_url": "https://m.media-amazon.com/images/I/51z+yCfTKMS._AC_.jpg"
    },
    {
        "product_id": "B078YMYB9P",
        "title": "RICHEN 11 11.6 12 12.5 13 inches Case Laptop/Chromebook/Ultrabook/MacBook pro air Notebook PC Messenger Bag Tablet Travel Case Neoprene Handle Sleeve with Shoulder (11-13.3 inch, Butterflies)",
        "brand": "RICHEN",
        "category": "Electronics",
        "price": 22.98,
        "description": "",
        "average_rating": 4.7,
        "total_reviews": 7306,
        "image_url": "https://m.media-amazon.com/images/I/51U-pjnzvAL._AC_.jpg"
    },
    {
        "product_id": "B07RWDZ3HG",
        "title": "SilverStone Technology SST-FF121 120mm Ultra Fine Fan Filter with Magnet Cooling,black",
        "brand": "SilverStone Technology",
        "category": "Electronics",
        "price": 6.47,
        "description": "Finding a quiet and efficient cooling fan is the ultimate goal for every enthusiast. The SST-FF121 is a fan grille designed for easy installation with any 120mm fan. The honeycomb pattern on the grille not only reduces wind shear noise but also channels the airflow into more focused beam. Its integrated filter also provides reduced dust buildup to extend the life cycle of components. All in all, the SST-FF121 is an excellent upgrade for any 120mm fans in your system.",
        "average_rating": 4.5,
        "total_reviews": 5340,
        "image_url": "https://m.media-amazon.com/images/I/61tNUJeo83L._AC_.jpg"
    },
    {
        "product_id": "B078GTQQF9",
        "title": "Asng Samsung Galaxy Tab A 9.7 Folio Case - Slim Fit Premium Vegan Leather Cover for Samsung Tab A 9.7-Inch Tablet SM-T550, SM-P550 (with Auto Sleep/Wake Feature) (Black)",
        "brand": "Asng",
        "category": "Electronics",
        "price": 11.9,
        "description": "Compatibility:   This Asng case specially designed for 2015 Galaxy Tab A Tablet 9.7 inch (SM-T550 / P550)ONLY, Not Fit For other Samsung tablet.   Product Description:   The Asng Folio Classic Leather Case offers secure protection for your tablet while adding a range of versatile options.A smart holder is designed to hold your stylus pen, while a soft inner liner and protective corners help safeguard the tablet against scratches and damage. The super design allows for full access to touch screen, side buttons, charging, headset and camera ports. you can easily watch movies, play games and online chatting.This Asng case for Galaxy Tab A 9.7 tablet is ideal for the everyday user.   Including: 1x touch pen + 1x Galaxy Tab A 9.7 Case",
        "average_rating": 4.3,
        "total_reviews": 981,
        "image_url": "https://m.media-amazon.com/images/I/419ZlSkQAeL._AC_.jpg"
    },
    {
        "product_id": "B0BPDXN8MK",
        "title": "Bootable USB Stick for macOS X Catalina 10.15 - Full OS Install, Reinstall, Recovery and Upgrade",
        "brand": "Generic",
        "category": "Electronics",
        "price": 21.99,
        "description": "Bootable USB Stick - macOS X Catalina 10.15 - Full OS Install, Reinstall, Recovery and Upgrade . Please CHECK twice if your Mac model is compatible with this macOS!! If you are not 100% sure please message me your mac model and year and I can tell for sure if would work or not! Please do not buy it if you are not sure and to avoid being disappointed and affecting my feedback! Thank you. SUPPORTED MODELS FOR MAC OS X: iMacLate 2012 or later, iMac Proall models, MacBookEarly 2015 or later, MacBook AirMid 2012 or later, MacBook ProMid 2012 or later, including non-Retina Mac MiniLate 2012 or later, Mac ProLate 2013 or later This is the simplest possible install procedure: 1. Insert USB stick into USB drives. 2. Restart by holding the Alt key (or Option key, depending on the keyboard model). 3. Once the start options appear on the screen, you can release the ALT key, select the Install option and follow the instructions. You can choose to erase/format the hard disk before installation - recommended. [WARNING] This macOS Bootable USB Drive is only Compatible with Apple Mac Systems & it will NOT work on Window’s PC or Laptop. So Please Make Sure not to Purchase this if you don’t have a Mac System to avoid disappointment later as if you insert this bootable Drive in a Window’s PC or Laptop, you will get a Format Error Message. If you get any error message please access our online free technical support ( at the bottom of the installation instruction page which comes with the item)",
        "average_rating": 5.0,
        "total_reviews": 1,
        "image_url": "https://m.media-amazon.com/images/I/31gCmZUrwkL._AC_.jpg"
    },
    {
        "product_id": "B09SJ9192T",
        "title": "SAMSUNG 23.5” CF396 Curved Computer Monitor, AMD FreeSync for Advanced Gaming, 4ms Response Time, Wide Viewing Angle, Ultra Slim Design, LC24F396FHNXZA, Black",
        "brand": "SAMSUNG",
        "category": "Electronics",
        "price": 158.0,
        "description": "Enjoy a truly immersive viewing experience with the Samsung CF390 Curved Screen Computer Monitor. The 1800R curvature of the screen lets you enjoy big, bold and stunning panoramic views while you work or play. With its design inspired by the curve of the human eye, this monitor delivers a comfortable and enjoyable viewing experience for your home or office use. Featuring an ultra slim and sleek profile, it measures less than 0.5-inch thick. Samsung’s advanced VA panel technology minimizes light leakage across the entire screen and corners to deliver deeper, more uniform blacks. AMD FreeSync dynamically syncs the screen refresh rate with the frame rate of your content to minimize input latency and dramatically reduce image tearing and stutter during gaming. With its 4ms response time, you'll see the fastest on-screen motion clearly and smoothly with less blur, judder, and ghosting. The fast response time provides a steady visual, allowing gamers to compete at the highest level. Eye Saver Mode optimizes your viewing comfort by reducing blue light emissions and flickers at the touch of a button. The excellent 3000:1 contrast ratio delivers deep blacks and bright whites, so you can see clearly in the darkest or brightest scenes. The brightness is 200cd/m2. The Eco-Saving Plus feature reduces screen brightness to save power.",
        "average_rating": 4.7,
        "total_reviews": 24081,
        "image_url": "https://m.media-amazon.com/images/I/41dYF-lTQ0L._AC_.jpg"
    },
    {
        "product_id": "B09S9WMFQJ",
        "title": "DTTO for iPad Air 5th/4th Generation 10.9 inch Case 2022/2020, Premium Leather Business Folio Stand Cover with Pencil Holder, Also fit iPad Pro 11 inch 2021/2020/2018(1st/2nd/3rd Gen), Black",
        "brand": "DTTO",
        "category": "Electronics",
        "price": 20.99,
        "description": "",
        "average_rating": 4.7,
        "total_reviews": 225,
        "image_url": "https://m.media-amazon.com/images/I/41HhQOUeuKL._AC_.jpg"
    },
    {
        "product_id": "B00YW49ZJC",
        "title": "Seismic Audio SA-DR2-8 Ohm JBL Compatible Replacement Diaphragm - 2412H, 2412H-1, JRX, 100, 112, 115, Eon",
        "brand": "Seismic Audio",
        "category": "Electronics",
        "price": 23.99,
        "description": "8 Ohm JBL 2412 Compatible Replacement Diaphragm - Model: SA-DR2, Contents: 8 Ohm Replacement Titanium Diaphragm for JBL loudspeakers with 2412 Drivers, Nominal Impedance: 8 Ohms, Compatible with the following JBL loudspeaker enclosures: JBL Series: 2412, 2412H, 2412H-8, 2412-8, 2412-1, 2412H-1, 2412H-1-8,2412-1-8, JRX Series: JRX100, JRX112, JRX112M, JRX112MI, JRX115, JRX115I, JRX-100, JRX-112, JRX-112M, JRX-112MI, JRX-115, JRX-115I, Sound Factor Series: SF-15, SR-25, TR Series: TR-125, TR-225, Eon Series: 1500, Power10, 125-10000-00x, 339013-001X, MPro Series: MP-215, Additional Features: Quick disconnect spade connectors, Dimensions: Gasket 85mm, Terminal: .20\", Coil Diameter: 1\", Weight: 0.07 lbs. each, Warranty: One Year Warranty. The SA-DR2 diaphragm replacement kit is an 8 Ohm titanium diaphragm. This replacement diaphragm are made to be compatible with the JBL 2412 driver that is found in many JBL enclosures. These are made just like the original and have matching specifications. The SA-DR2 is for use in JBL loudspeaker enclosures and are compatible with the following models: JBL Series: 2412, 2412H, 2412-8, 2412H-8, 2412-1, 2412-H1, 2412-1-8, and 2412-H1-8 Eon Series: 1500, Power10, 339013-001X, and 125-10000-00X Sound Factor Series SF-15, SR-25 MPro Series: MP-215 TR Series: TR-125, TR-225 JRX Series: JRX100, JRX112, JRX112M, JRX112MI, JRX115, JRX115I, JRX-100, JRX-112, JRX-112M, JRX-112MI, JRX-115, and JRX-115I Never be without the parts you need to keep the music going! Order replacement diaphragms from Seismic Audio and make us your one stop shop for all your Pro Audio loudspeaker needs.",
        "average_rating": 4.5,
        "total_reviews": 50,
        "image_url": "https://m.media-amazon.com/images/I/51Y6wNhvdmL._AC_.jpg"
    },
    {
        "product_id": "B092891PY2",
        "title": "Leather 15.6 inch Laptop Backpack Hiking Camping Backpack Satchel Bookbag Travel Business Backpack CN-01 (Brown)",
        "brand": "Baosha",
        "category": "Electronics",
        "price": 39.99,
        "description": "",
        "average_rating": 4.5,
        "total_reviews": 127,
        "image_url": "https://m.media-amazon.com/images/I/41Olub3EswS._AC_.jpg"
    },
    {
        "product_id": "B081Q75F4H",
        "title": "Rinbers B116XAK01.1 01.2 11.6\" HD 1366x768 LCD Display Touch Screen Panel with 40 Pin Connector for HP Chromebook 11 11A G6 EE G8 EE Touch 11 G7 EE 11MK G9 EE Touch L92828-001",
        "brand": "Rinbers",
        "category": "Electronics",
        "price": 65.99,
        "description": "Rinbers B116XAK01.1 01.2 11.6\" HD 1366x768 LCD Display Touch Screen Panel with 40 Pin Connector for HP Chromebook 11 11A G6 EE G8 EE Touch 11 G7 EE 11MK G9 EE Touch L92828-001",
        "average_rating": 3.1,
        "total_reviews": 8,
        "image_url": "https://m.media-amazon.com/images/I/41Uc0wtojIL._AC_.jpg"
    }
]